{"headline":{"0":"Aprenda os fundamentos da programação da maneira estruturada e projeta as suas primeiras linhas de programação com os especialistas do Vale do Silício.","1":"No primeiro curso do Nanodegree Desenvolvedor Android, uma base de nosso currículo de Android avancado e o desenvolvimento de aplicativos. This is encadeated in the middle of use Nele, voce tem uma palavra com os nossos instrutores, um novo passo para o desenvolvimento de um dispositivo Android e uma nuvem para Android, especificamente.","10":"Crie uma rede de contatos e uma capacidade de impressão para procurar emprego por emprego. Neste curso, você aprende estratégias e taticas para criar uma rede de contatos eficaz. Tambem aprender a ter suas proprias conexoes e online. Descobrira, ainda, como os relacionamentos com recrutadores, empregadores e profissionais do setor. Voce aprende a programar uma narrativa profissional e um discurso para apresentar suas ideias. Obter as dicas para o LinkedIn no LinkedIn e escrever e-mails que obtenham respostas. Forneceremos a voce uma confiana necessaria para realizar conexoes pessoais e incrementar sua busca por emprego.","11":"Ao longo deste curso, usaremos álgebra para quantificar e descrever o mundo ao nosso redor. Alguma vez você já se perguntou quantas músicas podem caber no seu pen drive? No final do curso, você terá mais habilidades para modelar problemas, analisar padrões e usar a álgebra para chegar a conclusões.","12":"Profissionais com conhecimento estatistico estao sendo cada vez mais requisitados no mercado. A lista de dados está disponível para todas as empresas que estão tendo esse relacionamento. For power analis, prever tendencias and realizar tests a estatistica and a notebook essential.","13":"Este curso é uma parte do","14":"Neste curso, você começará a trabalhar no seu primeiro Progressive Web App - um aplicativo da Web que pode aproveitar muitos dos recursos que os aplicativos nativos desfrutaram. Você também terá mais experiência na criação de um aplicativo Web que funcione offline usando os Service Workers. Por fim, você tornará seu aplicativo instalável na tela inicial do usuário com o arquivo de manifesto do aplicativo Web.","15":"Este curso é uma parte do","16":"Neste curso, desenvolvido em colaboração com a IBM e a Hashicorp, você aprenderá como criar aplicativos Swift do lado do servidor que são executados no Linux e na nuvem, incluindo como usar o Swift para criar um back-end de microsserviços. Este curso aborda as melhores práticas para construir e implantar o Swift do lado do servidor usando ferramentas comprovadas pelo setor como Docker e Terraform. Seja você um desenvolvedor da Apple, um desenvolvedor de pilha completa ou apenas começando a desenvolver aplicativos, este curso oferece uma oportunidade dominar o Swift do lado do servidor, enquanto ganha habilidades transferíveis vitais que podem ser usadas com qualquer pilha do lado do servidor. Inscreva-se no curso hoje e aproveite uma experiência de aprendizado repleta de recursos que é divertida, informativa e repleta de informações de especialistas das principais empresas do setor.","17":"Seu currículo e o primeiro passo da busca por emprego. To compare that you did, whom to ident as empresas que melhor combinam e demonstram as principais realizações de acordo com as cargas disponibilizadas por elas. <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br>.","18":"Ao longo deste curso, você aprenderá sobre a estrutura subjacente da Web - HTML. Você aprenderá a usar essa estrutura semelhante a uma árvore para criar sites. Você também aprenderá como aplicar estilos a um site por meio de CSS. Você aprenderá sobre sintaxe, seletores e unidades CSS. Ao longo do caminho, você também aprenderá sobre os editores de código e as ferramentas de desenvolvedor de um navegador.","19":"Este curso foi desenvolvido para ensinar você a gerenciar contêineres de aplicativos, usando o Kubernetes. Construímos esse curso em parceria com especialistas como Kelsey Hightower e Carter Morgan, do Google, e o ex-arquiteto de nuvem da Netflix, Adrian Cockcroft (atual Fellow de Tecnologia da Battery Ventures), que fornecem aprendizado crítico durante todo o curso. Dominar o gerenciamento de infraestrutura altamente resiliente e escalável é muito importante, porque a expectativa moderna é de que seus sites favoritos sejam atualizados 24 horas por dia, sete dias por semana, e que implantem novos recursos com frequência e sem interrupção do serviço. Atingir isso requer ferramentas que permitem garantir velocidade de desenvolvimento, estabilidade da infraestrutura e capacidade de dimensionamento. Recomenda-se a inscrição de alunos com experiência em Operações ou Desenvolvimento interessados ​​em gerenciar a infraestrutura baseada em contêineres com o Kubernetes! Neste curso, você aprenderá a: - Containerizar um aplicativo criando arquivos de configuração do Docker e processos de construção para produzir todas as imagens necessárias do Docker. configurar e lançar uma auto-scaling, o cluster Kubernetes auto-cura - Use Kubernetes para gerenciar a implantação, ampliação e atualização de seus aplicativos - Empregar as melhores práticas para a utilização de recipientes em geral, e especificamente Kubernetes, ao arquitetar e desenvolvimento de novos microservices","2":"Torne-se um especialista em anúncios do Google. Aprenda a criar, executar e obter campanhas de sucesso no Ads para seus resultados com seus produtos e seu negocio.","20":"This course and one format of preparation for entreviques tecnicas. Voce experimentara uma entrevista simulada, revisando uma analise sobre o dominio de perguntas-chave do setor. Tambem revisam topicos comuns de entrevistas para desenvolvedores VR, incluindo graficos 3D e otimizacao de cenas. Aprendera, ainda, boas práticas para responder a questões comportamentais e chegar a problemas de whiteboard. A partir deste momento, estar preparado (a) para exibir suas habilidades durante uma entrevista para desenvolvedor VR!","21":"Domine as habilidades de visão computacional por tras dos avancos em robotica e automacao. Some programas para analisar imagens, implementar extração de caracteristicas e programas de indexação em aprendizagem profunda.","22":"Conceitos básicos de inteligência artificial com inteligência como AI como Peter Norvig e Sebastian Thrun, casos que incluem busca, otimização, planejamento, reconhecimento de idéias e mais.","23":"O curso Solução de problemas com o Analytics fornece aos alunos o conhecimento básico para usar a análise de dados para criar percepções de negócios.\nVocê vai aprender:","24":"Aprenda a programar em Python e o primeiro passo para uma carreira como Cientista de Dados.","25":"Programação em Língua Natural Nanodegree para aprender tecnicas essenciais de PNL, incluindo reconhecimento de fala e traducao automatica. Torne-se um especialista em processamento de linguagem natural, ensinando os computadores a compreender, interpretando e manipulando uma linguagem humana.","26":"Faca parte de uma nova geracao de engenheiros que esta mudando o mundo, usando o poder da robótica para aumentar as capacidades de forma inovadora.","27":"Os carros autonomos são o futuro do transporte. Saiba o que faz um engenho que faz parte de um projeto nesse setor.","28":"Domine as skills of deep reinforcement learning that thiso impulsionando avancospositentes in AI. Entao, começa a ser aplicado em projetos de vídeo de uma robotica.","29":"Agora é preciso aprender os fundamentos da inteligência artificial e os principais conceitos de aprendizagem de máquina. Aprenda a programar em Python, álgebra linear, estatistica e visualização de dados para construir os melhores modelos preditivos e sua propria rede neural.","3":"Usamos sites o tempo todo, mas como clicar em um link em seu navegador ou digitar um URL na barra de endereço leva você a um site? Como o servidor sabe quais informações você está procurando ou como enviar essas informações uma vez que elas são descobertas? Como você pode proteger seus usuários contra invasores? Explore este curso e você poderá responder a essas perguntas!\n\nEste curso irá guiá-lo através de como um cliente se comunica com um servidor. Você aprenderá sobre o ciclo de solicitação e resposta do HTTP, acessará os cabeçalhos e verbos HTTP, distinguirá os recursos HTTP \/ 1 dos recursos HTTP \/ 2, tudo isso enquanto experimenta a importância da segurança, explorando os detalhes do HTTPS. Ao longo do curso, você aprenderá as práticas recomendadas de segurança e as maneiras de melhorar o desempenho de seus aplicativos da web. Forneceremos a você servidores criados manualmente, nos quais você diagnosticar configurações de servidor problemáticas, problemas com certificados SSL e até mesmo a chance de hackear um site de banco de exemplo para transferir fundos.","30":"Aprenda a organizar o código para seus aplicativos da web e por que é importante. Você estará usando o MVC Design Pattern no micro-framework de aplicações web, Sinatra.","31":"A demanda por considerações blockchain esta aumentando rapidamente. Neste programa, você trabalha com os protocolos do Bitcoin e do Ethereum, desenvolvendo projetos de aplicações reais e adquirindo as competências essenciais para iniciar uma carreira de aprendiz de blockchain.","32":"O deep learning esta gerando na inteligencia artificial avancos que estao mudando nosso mundo. Clique para ampliar e atualizar suas redes neurais para um fim de produzir soluções para os desafios importantes.","33":"Complete os reais, criados por especialistas do setor, cobrem os executivos da gestão de ativos com a criação de sinais de negociação. Domine os algoritmos de AI para negociar os ativos e construir seu portfólio profissional.","34":"This course and one format of preparation for entreviques tecnicas. Voce experimentara uma entrevista simulada, revisando uma análise detalhada sobre o dominio de perguntas-chaves do setor. Você também pode usar os aplicativos comuns para desenvolvimento de aplicativos Android, incluindo desde implementos explicativos e implícitos a uma pilha de um mínimo, aprendendo boas práticas para as questões comportamentais e problemas de whiteboard. A prepare o curso, estando preparado (a) para ficar atualizado durante uma entrevista para Android!","35":"React esta transformando completamente o Desenvolvimento Front-End. Domine com uma Udacity essa incremente biblioteca da UI do Facebook e torne-se um desenvolvedor web e mobile com React.","36":"This course and one format of preparation for entreviques tecnicas. Voce experimentara uma entrevista simulada, revisando uma analise sobre o dominio de perguntas-chave do setor. Tambem revisaram topicos comuns das entrevistas para o iOS, abrangendo notificacoes para as delegacias do modelo-vista-controlador, aprendendo boas praticas para as perguntas comportamentais e os problemas do whiteboard. Voce sabre como falar sobre seus interesses no desenvolvimento iOS. Desenvolvedores seniores de aplicativos móveis compartilham suas recomendações sobre como lidar com problemas comuns de dados. To complete este curso, voce to sendo mais preparado para agendar suas entrevistas durante uma entrevista para desenvolvedor (a) iOS!","37":"Fazer este curso fornecerá uma base básica na sintaxe Java, que é o primeiro passo para se tornar um desenvolvedor Java bem-sucedido. Você aprenderá como os computadores tomam decisões e como o Java rastreia as informações por meio de variáveis ​​e tipos de dados. Você aprenderá a criar instruções condicionais, funções e loops para processar informações e resolver problemas. Você ainda aprenderá a usar o IntelliJ, um Java IDE (Ambiente de Desenvolvimento Integrado) que os desenvolvedores profissionais usam para compilar, compilar e depurar seu código. Estas são habilidades de programação fundamentais, e dominá-las é uma obrigação para todos os aspirantes a programadores.","38":"Neste curso, você criará o FriendlyChat, um aplicativo de bate-papo em texto e imagens em tempo real.","39":"Profissionais com conhecimento analítico e prático estão sendo cada vez mais requisitados no mercado. To all the companies with the data the quantity of data to the which companies aso this having which has the same as taking to a mil. Para testar e implementar melhorias, não há um site ou aplicativo de mudança de empresa, uma efetiva concepção de testes.","4":"Neste curso, você terá experiência prática para tornar os aplicativos da Web acessíveis. Você entenderá quando e por que os usuários precisam de acessibilidade. Em seguida, você mergulhará no como: fazer uma página funcionar corretamente com leitores de tela e gerenciar o foco de entrada (por exemplo, o destaque que você vê ao percorrer um formulário). Você entenderá o significado da semântica e da marcação semântica para páginas da Web e adicionará a marcação ARIA. uma gama de dispositivos auxiliares. Finalmente, você aprenderá técnicas de estilo que ajudam os usuários com visão parcial a navegar nas suas páginas com facilidade e confiabilidade.","40":"Aprendizagem dos fundamentos do iOS usando uma linguagem rápida e o Xcode, uma ferramenta de desenvolvimento da Apple. Voce desenvolveu seus primeiros aplicativos iOS usando layouts, views, UIKit e muito mais.","41":"Aprenda a usar o projeto Design Sprint para testar ideias, alavancar oportunidades e potencializar uma inovacao. Com o acompanhamento de especialistas e muito treinamento prático, você pode tomar uma decisão na resolução de problemas.","42":"This course and ideal to empreendedores that use the universal digital your favor. Realize o seu negócio na internet, aprenda sobre finanças e precificação, otimize seus investimentos de marketing no Facebook, Instagram e Google Ads, e entre na regulamentação brasileira que impacta sua empresa.","43":"* ou R $ 1999 a vista.","44":"Nesse Curso de Inicialização, você aprende como fazer a sua ideia do papel em 12 semanas. Com o exemplo de especialistas do ramo empreendedor e de formação de pessoas, faça um plano de negócios e tenha uma oportunidade de negociar, melhore sua proposta de valor e aprenda a escalar. No fim, tenha uma chance de apresentar sua ideia em um dia de demonstração em São Paulo.","45":"Profissionais com conhecimento de programação estão sendo cada vez mais requisitados no mercado. Isso acontece devido ao crescimento constante da digitalização de empresas e seus produtos. Para criar novas páginas web e sistemas interativos, o conhecimento de JavaScript e seus conceitos fundamentais e uma habilidade essencial.","46":"Inteligência Artificial (IA) e um campo que tem longa história, mas esta está constantemente crescendo e crescendo. This course, you will learn as in the basic presents of the IA, including algumas das representatives of IA. To along of the path, hope to explore the inumeras applications and Indonesian applications in the area of ​​IA, which continua a expandir-se a human to in our in our imaginacao.","47":"Domine as ultimas ferramentas e tecnologias de VR. Aprenda com especialistas do setor, como Google, Unity e HTC, e torne-se desenvolvedor (a) de realidade virtual.","48":"Adquirindo competências para a construção de aplicações web do início de uma interface do servidor. Aprendizagem e pesquisa do Vale do Silício e impulsão de seu currículo para o trabalho em produtos emergentes de startups ou de grandes empresas.","49":"Aprenda a fazer os preditivos que o Iraque possibilita a agir, aprender e tomar decisões baseadas em dados. Voce aprendeu os conceitos fundamentais de avaliacao e validacao de modelos, aprendizagem supervisionada, aprendizagem nao-supervisionada, aprendizagem por reforco e aprendizagem profunda.","5":"Comece a aprender como é fácil de usar uma Cientista de Dados. Estude de Forma Prática Estatística e Probabilidade e Como Fazer o Simples do Que Imagina. Aprender a lançar e apagar dados para realizar melhores análises e diferenciar-se com uma introdução em Máquina Aprendendo a fazer um modelo de comutação mapear futur","50":"Adquirir skills relacionados a analyses de dados tem sido um grande diferencial para os profissionais do mercado atual. Tomar decisões mais precisas, antecipar tendências e analisar variáveis ​​são alguns dos estudos que você pode realizar. E tudo isso sem precisar de experiência em programação!","51":"Começar um adquirir as habilidades para um perfil analítico aprendendo Excel, SQL e visualização de dados.","52":"Google e Udacity create this course for you aprofunde os their languages ​​in development Android. Os seus aplicativos Android mais completos através da integração com APIs e bibliotecas, widgets e arquivos de mídia, gerenciamento de dados e informações que rodam em segundo plano.","53":"Aprender na prática com o Google e Udacity conceitos avançados de desenvolvimento Android. Torne seus aplicativos ainda mais completos e escaláveis ​​com Gradle, Material Design, Google Play Services e Firebase.","54":"Aprenda os conceitos básicos da programação Android e Java e dê o primeiro passo na sua jornada para se tornar um desenvolvedor Android!","55":"Domine os fundamentos de back-end, bancos de dados a servidores web, e desenvolva competências competitivas para esta área com especialistas do Vale do Silício.","56":"Profissionais com conhecimento analítico estão sendo cada vez mais requisitados no mercado. Todas as empresas estao com registro de dados de todos os empresas estao tendo que lidar. Para resumir e visualizar como características importantes de um conjunto de dados, uma análise exploratória de dados através da linguagem R e uma habilidade essencial.","57":"Domine a construcao e deploy de aplicacoes web multiusuarios utilizando o Flask, um microframework em Python versatil e flexivel used por grandes empresas, tais como Netflix, Uber e LinkedIn. Por fim, uma vez que os sistemas de autenticação como o Google e Facebook, implementam APIs RESTful e fazer deploy em servidores Linux.","58":"A sua interface como desenvolvedor web é uma ferramenta de desenvolvimento de interfaces, performance e performance. Domine as skills fundamental exigidas in recommendations professionals and amplie their horizontes neste mercado que nunca para de crescer.","59":"Aprenda a criar aplicativos completos, escalonáveis ​​e de alto desempenho para iOS de forma simples e se aplicamvel. Amplie seus horizontes este mercado que nunca para de crescer.","6":"Dez minutos para esta aula, você fará sua própria versão completamente personalizada do insana e viciante jogo 2048. Mesmo que você nunca tenha codificado antes. Muito legal, não? Você fará isso fazendo pequenas (mas importantes) modificações no código fonte do jogo original de 2048. Se isso soa intimidante, não se preocupe. Vamos ensinar os conceitos básicos de HTML e CSS e como eles interagem com o Javascript (não se preocupe se essa frase não significa nada para você ainda. Será em breve). O objetivo desta aula é se divertir aprendendo como para rapidamente e facilmente pegar um programa de código aberto existente, fazer algumas mudanças e criar algo que pareça e seja completamente novo. O jogo que você criar será compatível com dispositivos móveis (você poderá usá-lo em seu telefone!) E totalmente compartilhável.","60":"Google e Udacity construir este curso online de desenvolvimento Android para começar a sua jornada de programação móvel! Aprender uma linguagem Java e começar a usar os aplicativos para dispositivos de pesquisa!","61":"This introduction the course of computer computing, when you are learnt and practive concepts of the computational computational computators, construindo suas proprias versoes de aplicacoes web popular. Voce vai aprender Python, uma linguagem de programacao poderosa, facil de aprender, e amplamente utilizado, e voce vai explorar nocoes basicas de informatica, construindo seu proprio motor de busca e rede social.","62":"Aprenda a lidar com problemas de big data com seus próprios clusters do Hadoop! Neste curso, você implantará clusters do Hadoop na nuvem e os usará para obter insights de grandes conjuntos de dados.","63":"Este curso destina-se a ensinar os alunos a compreender e identificar as diferenças entre as linguagens de programação Objective-C e Swift e, em especial, como reescrever do primeiro para o último. Entender as comunicações entre as duas linguagens de \"interoperabilidade\" está se tornando cada vez mais importante para os desenvolvedores, especialmente à medida que nos preparamos para a chegada do Swift 3.0. No curso, os alunos irão escrever aulas e adicionar funcionalidade às aulas, escrevendo e chamando métodos. Depois de aprender alguma sintaxe básica do Objective-C, os alunos examinarão e dividirão um aplicativo escrito em Objective-C e o reescreverão no Swift. O curso terminará com uma revisão e prática dos desafios mais comuns de interoperabilidade entre Objective-C e Swift.","64":"Aqui está uma pergunta importante que os desenvolvedores do Android perguntam ao criar aplicativos:","65":"O Pete LePage do Google! Voce vai criar sua propria pagina web responsiva que funciona bem em qualquer dispositivo - telefone, tablet, desktop ou qualquer outro. Voce vai comecar a explorar o que um site agil e como alguns padroes comuns de design responsivo funciona em diferentes dispositivos. A partir do uso de consultas de mídia do CSS e um viewport de tags. You are the testing to interrupcao to larger and lower to the reading and lower to reading.","66":"Nesta aula de programação introdutória, você vai aprender Programação Orientada a Objetivos, uma técnica importante para os engenheiros de software que permitem uma reutilização e compartilhamento de código com facilidade. Voce vai aprender fazendo, e vai fazer um mini projeto em cada licao para aprender e a executar os conceitos de programacao.","67":"Este curso apresentará o conteúdo disponível por meio das APIs do Google Maps. Você passará pela construção de um site de listagens de imóveis passo a passo, usando um mapa do Google com um belo estilo, visualização de dados, panoramas de exibição de rua e vários recursos interessantes relacionados ao local, como calcular a distância entre locais, obter direções e visualizar locais de dados de juros. Você também verá outros exemplos de APIs do Google Maps em ação e entenderá como colocar seu novo conhecimento em prática criando seu próprio projeto no Console de APIs do Google.","68":"This course and one format of preparation for entreviques tecnicas. Voce experimentara uma entrevista simulada, revisando uma analise sobre o dominio de perguntas-chave do setor. Revistas topicas comuns em entrevistas para desenvolvedores Full Stack, como os funcoes em paleta e estrutura de dados. Aprendera, ainda, boas práticas para questões comportamentais e problemas de whiteboard. Em primeiro lugar, estar preparado (a) para manter-se informado durante uma entrevista para o Full Stack!","69":"Voce tem alguma experiencia desenvolvendo aplicativos para iPhone ou iPad e gostaria de criar um aplicativo para zero, mas nao sabe por onde comecar? Nao procure mais! This study, aprende a efetuar todo o processo de criação de um aplicativo iOS, comecando com uma ideia inicial e terminando com uma publicação na App Store.","7":"Aprenda os fundamentos da visualização de dados e pratique a comunicação com os dados. Este curso aborda como aplicar princípios de design, percepção humana, teoria de cores e contar histórias com dados. Se você apresentar dados a outros, aspirar a ser um analista de negócios ou um cientista de dados, ou se quiser se tornar mais eficiente com ferramentas de visualização, poderá aumentar suas habilidades com esse curso.\n\n\nEste curso é parte dos Programas de Previsão de Negócios e de Nanodegree Data Analyst.","70":"Este curso conduziu uma entrevista simulada, oferecendo análise sobre o dominio de perguntas-chave do setor. Voce revisara topicos common questions to developers front-end, abrangendo funcoes e fechos de palhetons e aprendizado de boas praticas para as questões comportamentais e problemas de whiteboard. Em primeiro lugar, você deve estar apto a (a) front-end!","71":"O curso Criando um Conjunto de Dados Analítico fornece aos alunos um conhecimento básico para inserir, limpar, mesclar e formatar dados em preparação para a análise. Você vai aprender:","72":"Esse curso do Google Analytics inclui aulas de treinamento avançado e treinamento prático para uma ferramenta principal de análise da web. Aprenda a criar painéis, indicar o comportamento dos utilizadores, avaliar as campanhas de marketing digital e impulsionar o crescimento do seu negócio.","73":"O GitHub e uma plataforma mais conceituada para demonstrar seus projetos de programação. Alguns recrutadores técnicos e geradores de contratação de uso, inclusive, para encontrar candidatos. This course, voce learn with knowledge technical as well praticas to GitHub. Tambem realizara comparações entre diferentes estilos de alteracao de commits, forking de repositorios e merging de solicitacoes de atualizacao. Compreender, ainda, como organizar seu código para finalizar seus projetos técnicos. Alem disso, aprender a colaborar com outros engenheiros no GitHub. Gerentes de contratação de técnicos compartilham dicas sobre seu perfil do GitHub que possibilitam mais oportunidades de emprego. Adquira uma confianca necessaria para estabelecer sua presenca na comunidade open source.","8":"Neste curso, você aprenderá como usar o Firebase com os especialistas do Google. O Firebase e uma plataforma de desenvolvimento de aplicativos que fornecem as melhores opções de recursos e uma capacidade de plataforma, permitindo a criação de aplicativos de alta qualidade com rapidez. Neste curso, voce cria o FriendlyChat, um bate-papo de imagem e texto em tempo real. Para comecar, voce tem como e facilitar e gravar dados no Firebase. Depois disso, aprender a permitir o login dos usuários com um e-mail ou conta do Google. Em seguida, sera capacitado para usar uma linguagem de segurança e regras do Firebase para adicionar permissões a seus dados e protegidos. Na segunda aula, voce conhecera o Firebase Storage, que permite que os usuarios faam upload do conteudo de seus dispositivos. Na sequencia, ter uma visão geral do Firebase Analytics para poder analisar os dados de uso do aplicativo e tomar decisões. Depois disso, voce pode obter notificacoes do Firebase, sendo capaz de enviar notificacoes a dados personalizados de usuarios. Por fim, voce entende como as configurações remotas do Firebase, para poder sintonizar e planejar seu aplicativo sem necessidade de publicar uma nova versão. This is that goo and the software to Android, which can storage and sharing data to different users in real time, bem como authenticate and autorizar ones usuarios.","9":"Neste curso, você aprenderá as melhores práticas para criar interfaces do iOS. Você construirá interfaces adaptáveis ​​que se adaptam a diferentes ambientes de exibição, animam elementos de interface do usuário e exibem transições e analisam designs de aplicativos populares na App Store."},"title":{"0":"Curso de Introdução à Programação - Nanodegree Udacity","1":"Desenvolvimento de aplicativos Android","10":"Curso de Google Ads | Conheça o Nanodegree da Udacity","11":"Client-Server Communication","12":"Web Accessibility","13":"Curso de Data Science | Nanodegree Fundamentos de Data Science II da Udacity","14":"Make Your Own 2048","15":"Data Visualization in Tableau","16":"Firebase em um fim de semana com o Google: Android","17":"Building iOS Interfaces","18":"Construindo sua marca pessoal online","19":"Visualizing Algebra","2":"Introdução à Estatística Descritiva","20":"Android Basics: Networking","21":"Intro to Progressive Web Apps","22":"Android Basics: Multi-screen Apps","23":"Server-Side Swift","24":"Aprimore seu currículo","25":"HTML and CSS Syntax","26":"Scalable Microservices with Kubernetes","27":"Entrevista técnica: Realidade Virtual VR","28":"Computer Vision Expert","29":"Artificial Intelligence Concepts","3":"Problem Solving with Advanced Analytics","30":"Curso de Python: Fundamentos de Data Science I – Udacity","31":"Natural Language Processing Expert","32":"Curso de Robótica | Conheça o Nanodegree Engenheiro de Robótica","33":"Curso de Introdução a Carros Autônomos","34":"Nanodegree Deep Reinforcement Learning Expert | Udacity","35":"Curso de Machine Learning | Nanodegree Fundamentos de Machine Learning da Udacity","36":"The MVC Pattern in Ruby","37":"Nanodegree Desenvolvedor Blockchain","38":"Curso de Deep Learning | Conheça o Nanodegree da Udacity","39":"Artificial Intelligence for Trading | Udacity","4":"Entrevista técnica: Android","40":"Curso de React: Nanodegree Desenvolvedor React | Udacity","41":"Entrevista técnica: iOS","42":"Java Programming Basics","43":"Firebase in a Weekend by Google: iOS","44":"Teste A\/B","45":"Curso de iOS | Conheça o Nanodegree Desenvolvedor iOS da Udacity","46":"Design Sprint: conheça o método e nosso curso | Udacity","47":"Curso de Negócios Digitais | Conheça o curso de pequenos negócios da Udacity","48":"Curso de Data Science - Big Data, Engenharia de Software e Machine Learning","49":"Curso de Startup | Aprenda como criar uma startup no Nanodegree Startup Founder","5":"Fundamentos de JavaScript","50":"Introdução à Inteligência Artificial","51":"Curso Desenvolvedor de Realidade Virtual | Conheça o Nanodegree da Udacity","52":"Curso Online de Desenvolvimento Web Full Stack | Nanodegree Udacity","53":"Curso de Engenheiro de Machine Learning | Nanodegree da Udacity","54":"Curso de Analista de Negócios | Nanodegree Análise de Dados da Udacity","55":"Curso Análise de Dados: Fundamentos e Introdução | Udacity","56":"Curso de Desenvolvimento Android Online | Nanodegree da Udacity","57":"Curso de Desenvolvimento Android Online | Nanodegree da Udacity","58":"Android Basics: User Interface","59":"Curso de Desenvolvimento Back End | Nanodegree da Udacity","6":"Análise de Dados com R","60":"Curso de Desenvolvimento Back End | Nanodegree da Udacity","61":"Front-End: curso online de fundamentos web | Udacity","62":"Curso de iOS | Conheça o Nanodegree Desenvolvedor iOS da Udacity","63":"Comece o Curso de desenvolvimento Android Online | Nanodegre Android Basics","64":"Introdução à Ciência da Computação","65":"Deploying a Hadoop Cluster","66":"Objective-C for Swift Developers","67":"How to create &lt;anything&gt in Android","68":"Fundamentos do Design Responsivo para a Web","69":"Fundamentos da Programação com Python","7":"Google Maps APIs","70":"Entrevista técnica: Full Stack","71":"Como criar um aplicativo iOS","72":"Entrevista técnica: Front-end","73":"Creating an Analytical Dataset","8":"Google Analytics: curso online de web analytics | Udacity","9":"Otimizando seu perfil do GitHub"}}