[
{"title": "Curso de Introdução à Programação - Nanodegree Udacity", "headline": "Aprenda os fundamentos de programação de maneira estruturada e crie suas primeiras linhas de código com especialistas do Vale do Silício.", "headline_free_course": null},
{"title": "Desenvolvimento de aplicativos Android", "headline": null, "headline_free_course": null},
{"title": "HTML and CSS Syntax", "headline": null, "headline_free_course": null},
{"title": "Java Programming Basics", "headline": null, "headline_free_course": "Taking this course will provide you with a basic foundation in Java syntax, which is the first step towards becoming a successful Java developer. You’ll learn how computers make decisions and how Java keeps track of information through variables and data types. You’ll learn to create conditional statements, functions, and loops to process information and solve problems. You’ll even learn to use IntelliJ, a Java IDE (Integrated Development Environment) that professional developers use, to build, compile, and debug your code. These are foundational programming skills, and mastering them is a must for all aspiring programmers."},
{"title": "Teste A/B", "headline": null, "headline_free_course": null},
{"title": "Introdução à Inteligência Artificial", "headline": null, "headline_free_course": null},
{"title": "Android Basics: User Interface", "headline": null, "headline_free_course": "\n\n"},
{"title": "Introdução à Ciência da Computação", "headline": null, "headline_free_course": null},
{"title": "Fundamentos do Design Responsivo para a Web", "headline": null, "headline_free_course": "\n\n"},
{"title": "Fundamentos da Programação com Python", "headline": null, "headline_free_course": " "},
{"title": "Introdução à Estatística Descritiva", "headline": null, "headline_free_course": null},
{"title": "Fundamentos de JavaScript", "headline": null, "headline_free_course": null},
{"title": "Análise de Dados com R", "headline": null, "headline_free_course": null},
{"title": "Google Analytics: curso online de web analytics | Udacity", "headline": "Esse curso de Google Analytics inclui aulas de alto nível e treinamento prático para você dominar a principal ferramenta de web analytics. Aprenda a criar dashboards, entender o comportamento dos usuários, avaliar campanhas de marketing digital e impulsionar o crescimento do seu negócio.", "headline_free_course": null},
{"title": "Curso de Google Ads | Conheça o Nanodegree da Udacity", "headline": "Torne-se um especialista em Google Ads. Aprenda a criar, executar e analisar campanhas de sucesso no Ads para obter melhores resultados com seus produtos e seu negócio.", "headline_free_course": null},
{"title": "Curso de Data Science | Nanodegree Fundamentos de Data Science II da Udacity", "headline": "Comece a aprender as principais habilidade exigidas de um Cientista de Dados. Estude de forma prática Estatística e Probabilidade e veja como podem ser mais simples do que imagina. Aprenda a tratar e limpar dados para realizar melhores análises e diferencie-se com uma introdução em Machine Learning sendo capaz de começar a mapear comportamentos futuros", "headline_free_course": null},
{"title": "Make Your Own 2048", "headline": null, "headline_free_course": "\n\n"},
{"title": "Building iOS Interfaces", "headline": null, "headline_free_course": null},
{"title": "Visualizing Algebra", "headline": null, "headline_free_course": null},
{"title": "Server-Side Swift", "headline": null, "headline_free_course": "\n\n"},
{"title": "iOS Design Patterns", "headline": null, "headline_free_course": null},
{"title": "Entrevista técnica: Realidade Virtual VR", "headline": null, "headline_free_course": "Este curso é uma excelente forma de preparação para entrevistas técnicas. Você experimentará uma entrevista simulada, revisando uma análise detalhada acerca do domínio de perguntas-chave do setor. Também revisará tópicos comuns de entrevistas para desenvolvedor VR, incluindo gráficos 3D e otimização de cenas. Aprenderá, ainda, boas práticas para responder a perguntas comportamentais e solucionar problemas de whiteboard. Após concluir este curso, estará preparado(a) para demonstrar suas habilidades durante uma entrevista para desenvolvedor VR!"},
{"title": "The MVC Pattern in Ruby", "headline": null, "headline_free_course": "Learn how to organize the code for your web apps, and why it's important. You’ll be using the MVC Design Pattern in the web application micro-framework, Sinatra."},
{"title": "Passwordless Login Solutions for iOS", "headline": null, "headline_free_course": "\n\n"},
{"title": "Cyber-Physical Systems Design & Analysis", "headline": null, "headline_free_course": null},
{"title": "Continuous Integration and Deployment", "headline": null, "headline_free_course": null},
{"title": "Dynamic Web Applications with Sinatra", "headline": null, "headline_free_course": null},
{"title": "Cenas e Objetos VR", "headline": null, "headline_free_course": null},
{"title": "Entrevista técnica: iOS", "headline": null, "headline_free_course": "Este curso é uma excelente forma de preparação para entrevistas técnicas. Você experimentará uma entrevista simulada, revisando uma análise detalhada acerca do domínio de perguntas-chave do setor. Também revisará tópicos comuns de entrevistas para desenvolvedores iOS, abrangendo de notificações até delegações do model-view-controller, aprendendo boas práticas para perguntas comportamentais e problemas de whiteboard. Você saberá como falar sobre seus interesses no desenvolvimento iOS. Desenvolvedores seniores de aplicativos móveis compartilharão suas recomendações sobre como abordar problemas comuns de dados. Ao concluir este curso, você estará muito mais preparado para demonstrar suas habilidades durante uma entrevista para desenvolvedor(a) iOS!"},
{"title": "Grand Central Dispatch (GCD)", "headline": null, "headline_free_course": "\n\n"},
{"title": "Tales from the Genome", "headline": null, "headline_free_course": null},
{"title": "Xcode Debugging", "headline": null, "headline_free_course": "\n\n"},
{"title": "Firebase Analytics: iOS", "headline": null, "headline_free_course": "\n\n"},
{"title": "Firebase in a Weekend by Google: iOS", "headline": null, "headline_free_course": "In this course, you’ll build FriendlyChat, a realtime text and picture chat application."},
{"title": "Deploying Applications with Heroku", "headline": null, "headline_free_course": null},
{"title": "iOS Persistence and Core Data", "headline": null, "headline_free_course": null},
{"title": "AutoLayout", "headline": null, "headline_free_course": null},
{"title": "Software Analysis & Testing", "headline": null, "headline_free_course": null},
{"title": "GT - Refresher - Advanced OS", "headline": null, "headline_free_course": null},
{"title": "Core ML: Machine Learning for iOS", "headline": null, "headline_free_course": null},
{"title": "Mobile Design and Usability for iOS", "headline": null, "headline_free_course": "\n\n"},
{"title": "Desenvolvimento de Software VR", "headline": null, "headline_free_course": null},
{"title": "Add Google Sign-In to your Android Apps", "headline": null, "headline_free_course": "\n\n"},
{"title": "Health Informatics in the Cloud", "headline": null, "headline_free_course": "\n\n"},
{"title": "Curso de iOS | Conheça o Nanodegree Desenvolvedor iOS da Udacity", "headline": "Aprenda os fundamentos do desenvolvimento iOS usando a linguagem Swift e o Xcode, a ferramenta de desenvolvimento da Apple. Você desenvolverá seus primeiros apps iOS usando layouts,views, UIKit e muito mais.", "headline_free_course": null},
{"title": "Desenvolvimento Android Auto", "headline": null, "headline_free_course": "\n"},
{"title": "Design Sprint: conheça o método e nosso curso | Udacity", "headline": "Aprenda a usar o método Design Sprint para testar ideias, alavancar oportunidades e potencializar a inovação. Com o acompanhamento de especialistas e muito treinamento prático, você se tornará um especialista na resolução de problemas.", "headline_free_course": null},
{"title": "Curso de Negócios Digitais | Conheça o curso de pequenos negócios da Udacity", "headline": "Este curso é ideal para empreendedores que desejam utilizar o universo digital ao seu favor. Profissionalize o seu negócio na internet, aprenda sobre finanças e precificação, otimize seus investimentos de marketing no Facebook, Instagram e Google Ads, e entenda a regulamentação brasileira que impacta sua empresa.", "headline_free_course": null},
{"title": "Curso de Data Science - Big Data, Engenharia de Software e Machine Learning", "headline": "* ou R$ 1999 à vista.", "headline_free_course": null},
{"title": "Curso de Startup | Aprenda como criar uma startup no Nanodegree Startup Founder", "headline": "Nesse Curso de Startup, você aprenderá como tirar sua ideia do papel em 12 semanas. Com o exemplo de especialistas do ramo empreendedor e mentores individuais, crie seu plano de negócios e caso você já tenha um negócio, melhore sua proposta de valor e aprenda a escalar. No fim, tenha a chance de apresentar sua ideia em um Demo day em São Paulo.", "headline_free_course": null},
{"title": "Learn Backbone.js", "headline": null, "headline_free_course": "\n\n"},
{"title": "Curso Desenvolvedor de Realidade Virtual | Conheça o Nanodegree da Udacity", "headline": "Domine as últimas ferramentas e tecnologias de VR. Aprenda com especialistas do setor, como Google, Unity e HTC, e se torne desenvolvedor(a) de realidade virtual.", "headline_free_course": null},
{"title": "Curso de Marketing Digital | Conheça o Nanodegree da Udacity", "headline": null, "headline_free_course": null},
{"title": "Curso Online de Desenvolvimento Web Full Stack | Nanodegree Udacity", "headline": "Adquira competências essenciais para construir aplicações web do início ao fim, desde a interface até o servidor. Aprenda com especialistas e gigantes do Vale do Silício e impulsione o seu currículo para trabalhar em produtos emergentes de startups ou de grandes empresas.", "headline_free_course": null},
{"title": "Curso de Engenheiro de Machine Learning | Nanodegree da Udacity", "headline": "Aprenda a construir modelos preditivos que irão possibilitar computadores a agir, aprender e tomar decisões baseados em dados. Você aprenderá os conceitos fundamentais de avaliação e validação de modelos, aprendizagem supervisionada, aprendizagem não-supervisionada, aprendizagem por reforço e deep learning.", "headline_free_course": null},
{"title": "Introdução ao Deep Learning com PyTorch", "headline": null, "headline_free_course": null},
{"title": "Curso de Analista de Negócios | Nanodegree Análise de Dados da Udacity", "headline": "Adquirir habilidades relacionadas a análise de dados tem sido um grande diferencial para profissionais do mercado atual. Tomar decisões mais precisas, antecipar tendências e analisar variáveis são alguns dos estudos que você conseguirá realizar. E tudo isso sem precisar de experiência em programação!", "headline_free_course": null},
{"title": "Curso Análise de Dados: Fundamentos e Introdução | Udacity", "headline": "Comece a adquirir as habilidades para ter um perfil analítico aprendendo Excel, SQL e visualização de dados.", "headline_free_course": null},
{"title": "Curso de Desenvolvimento Android Online | Nanodegree da Udacity", "headline": "Google e Udacity criaram este curso para que você aprofunde os seus conhecimentos em desenvolvimento Android. Deixe seus apps Android mais completos através da integração com APIs e bibliotecas, widgets e arquivos de mídia, gerenciamento de dados e informações que rodam em segundo plano.", "headline_free_course": null},
{"title": "Curso de Desenvolvimento Android Online | Nanodegree da Udacity", "headline": "Aprenda na prática com o Google e Udacity conceitos avançados de desenvolvimento Android. Torne seus apps ainda mais completos e escaláveis com Gradle, Material Design, Google Play Services e Firebase.", "headline_free_course": null},
{"title": "Curso de Desenvolvimento Back End | Nanodegree da Udacity", "headline": "Domine os fundamentos de back-end, de bancos de dados a servidores web, e desenvolva competências essenciais desta área com especialistas do Vale do Silício.", "headline_free_course": null},
{"title": "Curso de Desenvolvimento Back End | Nanodegree da Udacity", "headline": "Domine a construção e deploy de aplicações web multiusuários usando o Flask, um microframework em Python versátil e flexível utilizado por grandes empresas, tais como a Netflix, Uber e LinkedIn. Por fim, aprenda a embutir sistemas de autenticação como o Google e Facebook, implementar APIs RESTful e fazer deploy em servidores Linux.", "headline_free_course": null},
{"title": "Front-End: curso online de fundamentos web | Udacity", "headline": "Inicie sua carreira como desenvolvedor web front-end e aprenda a construir interfaces responsivas, escaláveis e de ótima performance. Domine as habilidades fundamentais exigidas em desenvolvedores profissionais e amplie seus horizontes neste mercado que nunca para de crescer.", "headline_free_course": null},
{"title": "Curso de iOS | Conheça o Nanodegree Desenvolvedor iOS da Udacity", "headline": "Aprenda a criar aplicativos completos, escaláveis e de alto desempenho para iOS de forma simples e aplicável. Amplie seus horizontes neste mercado que nunca para de crescer.", "headline_free_course": null},
{"title": "Comece o Curso de desenvolvimento Android Online | Nanodegre Android Basics", "headline": "Google e Udacity construíram este curso online de desenvolvimento Android para você iniciar sua jornada de programação mobile! Aprenda a linguagem Java e comece a construir aplicativos espetaculares para bilhões de dispositivos!", "headline_free_course": null},
{"title": "Mobile Design and Usability for Android", "headline": null, "headline_free_course": "\n\n"},
{"title": "CSE 8803 Special Topics: Big Data", "headline": null, "headline_free_course": null},
{"title": "Cyber-Physical Systems Security", "headline": null, "headline_free_course": null},
{"title": "Intro Algebra Review", "headline": null, "headline_free_course": null},
{"title": "iOS Networking with Swift", "headline": null, "headline_free_course": null},
{"title": "Deploying a Hadoop Cluster", "headline": null, "headline_free_course": "Learn how to tackle big data problems with your own Hadoop clusters! In this course, you’ll deploy Hadoop clusters in the cloud and use them to gain insights from large datasets."},
{"title": "Classification Models", "headline": null, "headline_free_course": null},
{"title": "Engagement & Monetization | Mobile Games", "headline": null, "headline_free_course": "\n\n"},
{"title": "A/B Testing for Business Analysts", "headline": null, "headline_free_course": null},
{"title": "Model Building and Validation", "headline": null, "headline_free_course": "\n\n"},
{"title": "Intro to Theoretical Computer Science", "headline": null, "headline_free_course": null},
{"title": "Objective-C for Swift Developers", "headline": null, "headline_free_course": "This course is designed to teach students how to understand and identify the differences between the Objective-C and Swift programming languages, and especially, how to rewrite from the former to the latter. Understanding communications between the two languages—called \"interoperability\"—is becoming more and more important for developers, particularly as we prepare for the arrival of Swift 3.0. In the course, students will write classes and add functionality to classes by writing and calling methods. After learning some basic Objective-C syntax, students will examine and break down an app written in Objective-C and rewrite it in Swift. The course will conclude with a review of and practice with the most common challenges for interoperability between Objective-C and Swift."},
{"title": "College Algebra", "headline": null, "headline_free_course": null},
{"title": "Educational Technology", "headline": null, "headline_free_course": "\n\n"},
{"title": "How to create &lt;anything&gt in Android", "headline": null, "headline_free_course": "Here is one important question Android developers ask while making apps: "},
{"title": "Segmentation and Clustering", "headline": null, "headline_free_course": null},
{"title": "Eigenvectors and Eigenvalues", "headline": null, "headline_free_course": null},
{"title": "O que é localização", "headline": null, "headline_free_course": "\n\n"},
{"title": "IA Baseado em Conhecimento: Sistemas Cognitivos", "headline": null, "headline_free_course": "\n"},
{"title": "Swift for Developers", "headline": null, "headline_free_course": null},
{"title": "Building High Conversion Web Forms", "headline": null, "headline_free_course": "\n\n"},
{"title": "Entrevista técnica: Swift", "headline": null, "headline_free_course": null},
{"title": "Real-Time Analytics with Apache Storm", "headline": null, "headline_free_course": "\n\n"},
{"title": "Computational Photography", "headline": null, "headline_free_course": "\n\n"},
{"title": "Programming Languages", "headline": null, "headline_free_course": null},
{"title": "Entrevista técnica: Full Stack", "headline": null, "headline_free_course": "Este curso é uma excelente forma de preparação para entrevistas técnicas. Você experimentará uma entrevista simulada, revisando uma análise detalhada acerca do domínio de perguntas-chave do setor. Também revisará tópicos comuns em entrevistas para desenvolvedor Full Stack, como funções em palíndromo e estrutura de dados. Aprenderá, ainda, boas práticas para perguntas comportamentais e problemas de whiteboard. Após concluir este curso, estará preparado(a) para demonstrar suas habilidades durante uma entrevista para desenvolvedor Full Stack!"},
{"title": "Writing READMEs", "headline": null, "headline_free_course": null},
{"title": "Software Debugging", "headline": null, "headline_free_course": null},
{"title": "Como criar um aplicativo iOS", "headline": null, "headline_free_course": "Você tem alguma experiência desenvolvendo aplicativos para iPhone ou iPad e gostaria de criar um aplicativo do zero, mas não sabe por onde começar? Não procure mais! Neste curso, você aprenderá a executar todo o processo de criação de um aplicativo iOS, começando com a ideia inicial e terminando com a publicação na App Store."},
{"title": "Differential Equations in Action", "headline": null, "headline_free_course": null},
{"title": "Entrevista técnica: Front-end", "headline": null, "headline_free_course": "Este curso conduz a uma entrevista simulada, oferecendo análise detalhada acerca do domínio de perguntas-chave do setor. Você revisará tópicos comuns em entrevistas para desenvolvedores front-end, abrangendo funções e fechamentos de palíndromos e aprendendo boas práticas para perguntas comportamentais e problemas de whiteboard. Após concluir este curso, você estará apto(a) a demonstrar suas habilidades durante uma entrevista para desenvolvedor(a) front-end!"},
{"title": "Creating an Analytical Dataset", "headline": null, "headline_free_course": "The Creating an Analytical Dataset course provides students with foundational knowledge to input, clean, blend, and format data in preparation for analysis. You will learn:\n"},
{"title": "Web Tooling & Automation", "headline": null, "headline_free_course": null},
{"title": "Learn Swift Programming Syntax", "headline": null, "headline_free_course": "\n\n"},
{"title": "Passwordless Login Solutions for Android", "headline": null, "headline_free_course": "\n\n"},
{"title": "Applied Cryptography", "headline": null, "headline_free_course": null},
{"title": "Intro to Physics", "headline": null, "headline_free_course": null},
{"title": "Prototipagem Rápida", "headline": null, "headline_free_course": null},
{"title": "Object-Oriented JavaScript", "headline": null, "headline_free_course": null},
{"title": "Problem Solving with Advanced Analytics", "headline": null, "headline_free_course": "The Problem Solving with Analytics course provides students with the foundational knowledge to use data analytics to create business insights. \nYou will learn: \n"},
{"title": "Interactive 3D Graphics", "headline": null, "headline_free_course": null},
{"title": "How to Install Android Studio", "headline": null, "headline_free_course": null},
{"title": "Firebase Analytics: Android", "headline": null, "headline_free_course": "\n\n"},
{"title": "Computability, Complexity & Algorithms", "headline": null, "headline_free_course": "\n\n"},
{"title": "Entrevista técnica: Android", "headline": null, "headline_free_course": "Este curso é uma excelente forma de preparação para entrevistas técnicas. Você experimentará uma entrevista simulada, revisando uma análise detalhada acerca do domínio de perguntas-chaves do setor. Também trabalhará com tópicos comuns de entrevista para desenvolvedor Android, abrangendo desde intents explícitas e implícitas até a criação de um min stack, aprendendo boas práticas para perguntas comportamentais e problemas de whiteboard. Após concluir o curso, estará preparado(a) para demonstrar suas habilidades durante uma entrevista para desenvolvedor Android!"},
{"title": "2D Game Development with libGDX", "headline": null, "headline_free_course": null},
{"title": "Authentication & Authorization: OAuth", "headline": null, "headline_free_course": "\n\n"},
{"title": "Data Analysis and Visualization", "headline": null, "headline_free_course": "\n\n"},
{"title": "UIKit Fundamentals", "headline": null, "headline_free_course": null},
{"title": "Human-Computer Interaction", "headline": null, "headline_free_course": null},
{"title": "Intro to Point & Click App Development", "headline": null, "headline_free_course": "\n\n"},
{"title": "JavaScript and the DOM", "headline": null, "headline_free_course": null},
{"title": "Introdução ao AJAX", "headline": null, "headline_free_course": "\n\n"},
{"title": "Otimização de Renderização no Browser", "headline": null, "headline_free_course": "\n\n"},
{"title": "Compilers: Theory and Practice", "headline": null, "headline_free_course": null},
{"title": "Time Series Forecasting", "headline": null, "headline_free_course": null},
{"title": "Google Maps APIs", "headline": null, "headline_free_course": "This course will introduce you to the content available through the Google Maps APIs. You’ll be walked through building a real-estate listings site step-by-step, using a beautifully styled Google map, data visualization, street view panoramas, and various nifty location related features such as calculating distance between locations, getting directions, and viewing places of interest data.  You’ll also see other examples of Google Maps APIs in action, and understand how to put your new knowledge into practice by creating your own Project in the Google APIs Console."},
{"title": "Requisições assíncronas em JavaScript", "headline": null, "headline_free_course": null},
{"title": "GitHub & Collaboration", "headline": null, "headline_free_course": null},
{"title": "Configuring Linux Web Servers", "headline": null, "headline_free_course": "\n\n"},
{"title": "Visualização de dados e d3.js", "headline": null, "headline_free_course": null},
{"title": "Artificial Intelligence", "headline": null, "headline_free_course": null},
{"title": "High Performance Computer Architecture", "headline": null, "headline_free_course": "\n\n"},
{"title": "Network Security", "headline": null, "headline_free_course": "\n\n"},
{"title": "Android Performance", "headline": null, "headline_free_course": null},
{"title": "HTML5 Canvas", "headline": null, "headline_free_course": "\n\n"},
{"title": "Marketing de Aplicativos", "headline": null, "headline_free_course": null},
{"title": "Offline Web Applications", "headline": null, "headline_free_course": "\n\n"},
{"title": "Software Development Process", "headline": null, "headline_free_course": "\n\n"},
{"title": "Embedded Systems", "headline": null, "headline_free_course": null},
{"title": "Introdução ao jQuery", "headline": null, "headline_free_course": "\n\n"},
{"title": "Advanced Operating Systems", "headline": null, "headline_free_course": null},
{"title": "Intro to Information Security", "headline": null, "headline_free_course": "\n\n"},
{"title": "Otimizando seu perfil do GitHub", "headline": null, "headline_free_course": "O GitHub é a plataforma mais conceituada para demonstrar seus projetos de programação. Alguns recrutadores técnicos e gerentes de contratação o utilizam, inclusive, para encontrar candidatos. Neste curso, você aprenderá com especialistas técnicos as boas práticas do GitHub. Também realizará comparações entre diferentes estilos para alteração de commits, forking de repositórios e merging de solicitações de atualização. Compreenderá, ainda, como organizar seu código a fim de demonstrar seus projetos técnicos. Além disso, aprenderá a colaborar com outros engenheiros no GitHub. Gerentes de contratação técnicos compartilharão dicas sobre seu perfil do GitHub que possibilitam mais oportunidades de emprego. Adquira a confiança necessária para estabelecer sua presença na comunidade open source."},
{"title": "Workshop sobre shell", "headline": null, "headline_free_course": "\n\n"},
{"title": "Entrevista técnica: Cientista de Dados", "headline": null, "headline_free_course": null},
{"title": "Client-Server Communication", "headline": null, "headline_free_course": "We use websites all the time, but how does clicking a link in your browser or typing in a URL in the address bar get you to a website? How does the server know what information you're looking for or how to send you that information once it's figured that out? How can you protect your users from attackers? Dig into this course and you'll be able to answer these questions!\n\nThis course will guide you through how a client communicates with a server. You'll learn about HTTP's request and response cycle, dig into HTTP headers and verbs, distinguish HTTP/1 from HTTP/2 capabilities, all while experiencing the importance of security by digging into the details of HTTPS. Throughout the course, you'll learn both security best practices, as well as ways to improve the performance of your web apps. We'll provide you with handcrafted servers where you'll diagnose problematic server setups, issues with SSL certificates, and even have a chance to hack an example bank website to transfer funds."},
{"title": "Intro to Psychology", "headline": null, "headline_free_course": null},
{"title": "HTTP & Web Servers", "headline": null, "headline_free_course": "\n\n"},
{"title": "Testando JavaScript", "headline": null, "headline_free_course": null},
{"title": "Full Stack Foundations", "headline": null, "headline_free_course": "\n\n"},
{"title": "High Performance Computing", "headline": null, "headline_free_course": "\n\n"},
{"title": "Web Accessibility", "headline": null, "headline_free_course": "In this course you’ll get hands-on experience making web applications accessible. You’ll understand when and why users need accessibility. Then you’ll dive into the “how”: making a page work properly with screen readers, and managing input focus (e.g. the highlight you see when tabbing through a form.) You’ll understand what “semantics” and “semantic markup” mean for web pages and add ARIA markup to enable a range of assistive devices.  Finally, you’ll learn styling techniques that help users with partial vision navigate the your pages easily and reliability."},
{"title": "Networking for Web Developers", "headline": null, "headline_free_course": "\n\n"},
{"title": "Introdução à Realidade Virtual", "headline": null, "headline_free_course": null},
{"title": "Gradle para Android e Java", "headline": null, "headline_free_course": "\n\n"},
{"title": "Statistics", "headline": null, "headline_free_course": "\n\n"},
{"title": "JavaScript Promises", "headline": null, "headline_free_course": "\n\n"},
{"title": "Database Systems Concepts & Design", "headline": null, "headline_free_course": null},
{"title": "Tratamento de Dados com MongoDB", "headline": null, "headline_free_course": null},
{"title": "Swift for Beginners", "headline": null, "headline_free_course": null},
{"title": "Design of Computer Programs", "headline": null, "headline_free_course": null},
{"title": "Frameworks de Front-End", "headline": null, "headline_free_course": "\n\n"},
{"title": "Aprendizado por Reforço", "headline": null, "headline_free_course": null},
{"title": "Imagens Responsivas", "headline": null, "headline_free_course": "\n\n"},
{"title": "Data Visualization in Tableau", "headline": null, "headline_free_course": "Learn the fundamentals of data visualization and practice communicating with data. This course covers how to apply design principles, human perception, color theory, and effective storytelling with data. If you present data to others, aspire to be a business analyst or data scientist, or if you’d like to become more effective with visualization tools, then you can grow your skills with this course.\n\n\nThis course is part of both the Predictive Analytics for Business and Data Analyst Nanodegree Programs."},
{"title": "JavaScript Design Patterns", "headline": null, "headline_free_course": null},
{"title": "Inteligência Artificial para Robótica", "headline": null, "headline_free_course": null},
{"title": "Firebase em um fim de semana com o Google: Android", "headline": null, "headline_free_course": "Neste curso, você aprenderá a usar o Firebase com os especialistas do Google. O Firebase é uma plataforma de desenvolvimento de aplicativos que fornece aos desenvolvedores diversas ferramentas e uma infraestrutura escalável, permitindo a criação de aplicativos de alta qualidade com rapidez. Neste curso, você criará o FriendlyChat, um chat de imagem e texto em tempo real. Para começar, você verá como é fácil ler e gravar dados no Firebase. Depois disso, aprenderá a permitir o login dos usuários com um e-mail ou conta do Google. Em seguida, será capacitado para usar a linguagem de segurança e regras do Firebase para adicionar permissões a seus dados e protegê-los. Na segunda aula, você conhecerá o Firebase Storage, que permite que os usuários façam upload do conteúdo de seus dispositivos. Na sequência, terá uma breve visão geral do Firebase Analytics para poder analisar os dados de uso do aplicativo e tomar decisões. Depois disso, você explorará as notificações do Firebase, sendo capaz de enviar notificações a segmentos personalizados de usuários. Por fim, você compreenderá as configurações remotas do Firebase, para poder sintonizar e personalizar seu aplicativo sem a necessidade de publicar uma nova versão. Ao final deste curso, você terá um aplicativo Android que pode armazenar e compartilhar dados entre diferentes usuários em tempo real, bem como autenticar e autorizar esses usuários."},
{"title": "Intro to Hadoop and MapReduce", "headline": null, "headline_free_course": null},
{"title": "Software Architecture & Design", "headline": null, "headline_free_course": null},
{"title": "Software Testing", "headline": null, "headline_free_course": null},
{"title": "Designing RESTful APIs", "headline": null, "headline_free_course": "\n\n"},
{"title": "Version Control with Git", "headline": null, "headline_free_course": null},
{"title": "Linear Algebra Refresher Course", "headline": null, "headline_free_course": "\n\n"},
{"title": "Construindo sua marca pessoal online", "headline": null, "headline_free_course": "Criar uma rede de contatos é uma habilidade imprescindível para quem está procurando por emprego. Neste curso, você aprenderá estratégias e táticas para criar uma rede de contatos eficaz. Também aprenderá a realizar suas próprias conexões pessoalmente e online. Descobrirá, ainda, como estabelecer relacionamentos com recrutadores, empregadores e profissionais do setor. Você aprenderá a elaborar uma narrativa profissional e um discurso para apresentar suas ideias. Obterá dicas para otimizar seu perfil no LinkedIn e escrever e-mails que obtenham respostas. Forneceremos a você a confiança necessária para realizar conexões pessoais e incrementar sua busca por emprego."},
{"title": "Intro to DevOps", "headline": null, "headline_free_course": "\n\n"},
{"title": "ES6 - JavaScript aprimorado", "headline": null, "headline_free_course": null},
{"title": "Fundamentos de Carros Autônomos: Apresentando o Apollo", "headline": null, "headline_free_course": null},
{"title": "Kotlin para desenvolvedores Android", "headline": null, "headline_free_course": null},
{"title": "Intro to Relational Databases", "headline": null, "headline_free_course": "\n\n"},
{"title": "Material Design para Desenvolvedores Android", "headline": null, "headline_free_course": null},
{"title": "Otimização de Performance de Website", "headline": null, "headline_free_course": "\n\n\n"},
{"title": "JavaScript Orientado a Objetos", "headline": null, "headline_free_course": null},
{"title": "UX Design for Mobile Developers", "headline": null, "headline_free_course": null},
{"title": "Intro to the Design of Everyday Things", "headline": null, "headline_free_course": null},
{"title": "Introdução à Estatística Inferencial", "headline": null, "headline_free_course": null},
{"title": "Object Oriented Programming in Java", "headline": null, "headline_free_course": "\n\n"},
{"title": "Android Basics: Networking", "headline": null, "headline_free_course": "This course is a part of the "},
{"title": "Intro to Progressive Web Apps", "headline": null, "headline_free_course": "In this course you’ll get started working on your very first Progressive Web App - a web app that can take advantage of many of the features native applications have enjoyed. You’ll also get more experience in creating a web app that works offline using Service Workers. Finally, you’ll make your app installable to the user’s home screen with the Web App Manifest file."},
{"title": "Android Basics: Data Storage", "headline": null, "headline_free_course": null},
{"title": "Linha de Comando Linux Básico", "headline": null, "headline_free_course": " \n \n "},
{"title": "Android Basics: Multi-screen Apps", "headline": null, "headline_free_course": "This course is a part of the "},
{"title": "Intro to Algorithms", "headline": null, "headline_free_course": null},
{"title": "Computer Networking", "headline": null, "headline_free_course": "\n\n"},
{"title": "Introduction to Computer Vision", "headline": null, "headline_free_course": "\n\n"},
{"title": "Intro to iOS App Development with Swift", "headline": null, "headline_free_course": "\n\n"},
{"title": "Design de Produto", "headline": null, "headline_free_course": null},
{"title": "Introduction to Operating Systems", "headline": null, "headline_free_course": null},
{"title": "Aprendizado de Máquina", "headline": null, "headline_free_course": "\n"},
{"title": "Aprimore seu currículo", "headline": null, "headline_free_course": "Seu currículo é o primeiro passo da busca por emprego. Ao longo deste curso, você identificará as empresas que mais combinam com você e demonstrará suas principais realizações de acordo com os cargos oferecidos por elas. Por meio de nossa estrutura certificada, você criará um currículo voltado para a área de tecnologia, que fará com que você seja notado(a) e consiga a entrevista."},
{"title": "Desenvolvimento de Apps Android Avançado", "headline": null, "headline_free_course": null},
{"title": "C++ For Programmers", "headline": null, "headline_free_course": "\n\n"},
{"title": "Aprendizado de Máquina para Negociação", "headline": null, "headline_free_course": null},
{"title": "Introdução à Ciência de Dados", "headline": null, "headline_free_course": "\n"},
{"title": "SQL for Data Analysis", "headline": null, "headline_free_course": null},
{"title": "Scalable Microservices with Kubernetes", "headline": null, "headline_free_course": "This course is designed to teach you about managing application containers, using Kubernetes. We've built this course in partnership with experts such as Kelsey Hightower and Carter Morgan from Google and Netflix’s former Cloud Architect, Adrian Cockcroft (current Technology Fellow at Battery Ventures), who provide critical learning throughout the course. Mastering highly resilient and scalable infrastructure management is very important, because the modern expectation is that your favorite sites will be up 24/7, and that they will roll out new features frequently and without disruption of the service. Achieving this requires tools that allow you to ensure speed of development, infrastructure stability and ability to scale. Students with backgrounds in Operations or Development who are interested in managing container based infrastructure with Kubernetes are recommended to enroll!In this course you will learn to: - Containerize an application by creating Docker config files and build processes to produce all the necessary Docker images - Configure and launch an auto-scaling, self-healing Kubernetes cluster - Use Kubernetes to manage deploying, scaling, and updating your applications - Employ best practices for using containers in general, and specifically Kubernetes, when architecting and developing new microservices"},
{"title": "Android Basics: User Input", "headline": null, "headline_free_course": null},
{"title": "Bootcamp de Kotlin para programadores", "headline": null, "headline_free_course": null},
{"title": "Introduction to Python", "headline": null, "headline_free_course": null},
{"title": "Introdução ao Aprendizado de Máquina", "headline": null, "headline_free_course": "\n"},
{"title": "Introdução à Análise de Dados", "headline": null, "headline_free_course": "\n"},
{"title": "Introdução à Estatística", "headline": null, "headline_free_course": null},
{"title": "Entrevista técnica: Python", "headline": null, "headline_free_course": null},
{"title": "Como Usar o Git e o GitHub", "headline": null, "headline_free_course": " "},
{"title": "Deep Learning", "headline": null, "headline_free_course": null},
{"title": "Crie aplicativos móveis nativos com o Flutter", "headline": null, "headline_free_course": null},
{"title": "Computer Vision Expert", "headline": "Domine as habilidades de visão computacional por trás dos avanços em robótica e automação. Escreva programas para analisar imagens, implementar extração de características e reconhecer objetos utilizando modelos de deep learning.", "headline_free_course": null},
{"title": "Artificial Intelligence Concepts", "headline": "Aprenda conceitos fundamentais de inteligência artificial com especialistas de AI como Peter Norvig e Sebastian Thrun, incluindo busca, otimização, planejamento, reconhecimento de padrões e mais.", "headline_free_course": null},
{"title": "Curso de Python: Fundamentos de Data Science I – Udacity", "headline": "Aprenda a programar em Python e dê o primeiro passo para uma carreira como Cientista de Dados.", "headline_free_course": null},
{"title": "Natural Language Processing Expert", "headline": "Inscreva-se no programa Nanodegree Natural Language Processing para aprender técnicas essenciais de NLP, incluindo reconhecimento de fala e tradução automática. Torne-se um especialista em processamento de linguagem natural, ensinando os computadores a compreenderem, interpretarem e manipularem a linguagem humana.", "headline_free_course": null},
{"title": "Curso de Robótica | Conheça o Nanodegree Engenheiro de Robótica", "headline": "Faça parte de uma nova geração de engenheiros que estão mudando o mundo, usando o poder da robótica para aumentar nossas capacidades de forma inovadora.", "headline_free_course": null},
{"title": "Curso de Introdução a Carros Autônomos", "headline": "Os carros autônomos são o futuro do transporte. Saiba o que faz um engenheiro desse ramo e comece a construir as habilidades necessárias para obter um emprego nesse setor.", "headline_free_course": null},
{"title": "Nanodegree Deep Reinforcement Learning Expert | Udacity", "headline": "Domine as habilidades de deep reinforcement learning que estão impulsionando avanços surpreendentes em AI. Então, comece a aplicá-las em projetos que vão de videogames à robótica.", "headline_free_course": null},
{"title": "Curso de Machine Learning | Nanodegree Fundamentos de Machine Learning da Udacity", "headline": "Comece agora a aprender os fundamentos de inteligência artificial e os principais conceitos de machine learning. Aprenda a programar em Python, álgebra linear, estatística e visualização de dados para construir seus primeiros modelos preditivos e sua própria rede neural.", "headline_free_course": null},
{"title": "Nanodegree Desenvolvedor Blockchain", "headline": "A demanda por desenvolvedores blockchain está aumentando rapidamente. Neste programa, você trabalhará com os protocolos do Bitcoin e do Ethereum, desenvolverá projetos para aplicações reais e adquirirá as habilidades essenciais para iniciar uma carreira de desenvolvedor blockchain.", "headline_free_course": null},
{"title": "Curso de Deep Learning | Conheça o Nanodegree da Udacity", "headline": "O deep learning está gerando na inteligência artificial avanços que estão mudando nosso mundo. Inscreva-se agora para criar e aplicar suas próprias redes neurais profundas a fim de produzir soluções surpreendentes para desafios importantes.", "headline_free_course": null},
{"title": "Artificial Intelligence for Trading | Udacity", "headline": "Complete projetos reais, criados por especialistas do setor, que cobrem tópicos que vão da gestão de ativos até a criação de sinais de trading. Domine os algoritmos de AI para negociar ativos e construa seu portfólio profissional.", "headline_free_course": null},
{"title": "Curso de React: Nanodegree Desenvolvedor React | Udacity", "headline": "React está transformando completamente o Desenvolvimento Front-End. Domine com a Udacity essa incrível biblioteca de UI do Facebook e torne-se um desenvolvedor web e mobile com React.", "headline_free_course": null}
]