{"headline":{"0":"Aprenda os fundamentos da programacao da maneira estruturada e projeta as suas primeiras linhas de programacao com os especialistas do Vale do Silicio.","1":"No primeiro curso do Nanodegree Desenvolvedor Android, uma base de nosso curriculo de Android avancado e o desenvolvimento de aplicativos. This is encadeated in the middle of use Nele, voce tem uma palavra com os nossos instrutores, um novo passo para o desenvolvimento de um dispositivo Android e uma nuvem para Android, especificamente.","2":"Crie uma rede de contatos e uma capacidade de impressao para procurar emprego por emprego. Neste curso, voce aprende estrategias e taticas para criar uma rede de contatos eficaz. Tambem aprender a ter suas proprias conexoes e online. Descobrira, ainda, como os relacionamentos com recrutadores, empregadores e profissionais do setor. Voce aprende a programar uma narrativa profissional e um discurso para apresentar suas ideias. Obter as dicas para o LinkedIn no LinkedIn e escrever e-mails que obtenham respostas. Forneceremos a voce uma confiana necessaria para realizar conexoes pessoais e incrementar sua busca por emprego.","3":"Ao longo deste curso, usaremos algebra para quantificar e descrever o mundo ao nosso redor. Alguma vez voce ja se perguntou quantas musicas podem caber no seu pen drive? No final do curso, voce tera mais habilidades para modelar problemas, analisar padroes e usar a algebra para chegar a conclusoes.","4":"Profissionais com conhecimento estatistico estao sendo cada vez mais requisitados no mercado. A lista de dados esta disponivel para todas as empresas que estao tendo esse relacionamento. For power analis, prever tendencias and realizar tests a estatistica and a notebook essential.","5":"Este curso e uma parte do","6":"Neste curso, voce comecara a trabalhar no seu primeiro Progressive Web App - um aplicativo da Web que pode aproveitar muitos dos recursos que os aplicativos nativos desfrutaram. Voce tambem tera mais experiencia na criacao de um aplicativo Web que funcione offline usando os Service Workers. Por fim, voce tornara seu aplicativo instalavel na tela inicial do usuario com o arquivo de manifesto do aplicativo Web.","7":"Este curso e uma parte do","8":"Neste curso, desenvolvido em colaboracao com a IBM e a Hashicorp, voce aprendera como criar aplicativos Swift do lado do servidor que sao executados no Linux e na nuvem, incluindo como usar o Swift para criar um back-end de microsservicos. Este curso aborda as melhores praticas para construir e implantar o Swift do lado do servidor usando ferramentas comprovadas pelo setor como Docker e Terraform. Seja voce um desenvolvedor da Apple, um desenvolvedor de pilha completa ou apenas comecando a desenvolver aplicativos, este curso oferece uma oportunidade dominar o Swift do lado do servidor, enquanto ganha habilidades transferiveis vitais que podem ser usadas com qualquer pilha do lado do servidor. Inscreva-se no curso hoje e aproveite uma experiencia de aprendizado repleta de recursos que e divertida, informativa e repleta de informacoes de especialistas das principais empresas do setor.","9":"Seu curriculo e o primeiro passo da busca por emprego. To compare that you did, whom to ident as empresas que melhor combinam e demonstram as principais realizacoes de acordo com as cargas disponibilizadas por elas. <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br>.","10":"Ao longo deste curso, voce aprendera sobre a estrutura subjacente da Web - HTML. Voce aprendera a usar essa estrutura semelhante a uma arvore para criar sites. Voce tambem aprendera como aplicar estilos a um site por meio de CSS. Voce aprendera sobre sintaxe, seletores e unidades CSS. Ao longo do caminho, voce tambem aprendera sobre os editores de codigo e as ferramentas de desenvolvedor de um navegador.","11":"Este curso foi desenvolvido para ensinar voce a gerenciar conteineres de aplicativos, usando o Kubernetes. Construimos esse curso em parceria com especialistas como Kelsey Hightower e Carter Morgan, do Google, e o ex-arquiteto de nuvem da Netflix, Adrian Cockcroft (atual Fellow de Tecnologia da Battery Ventures), que fornecem aprendizado critico durante todo o curso. Dominar o gerenciamento de infraestrutura altamente resiliente e escalavel e muito importante, porque a expectativa moderna e de que seus sites favoritos sejam atualizados 24 horas por dia, sete dias por semana, e que implantem novos recursos com frequencia e sem interrupcao do servico. Atingir isso requer ferramentas que permitem garantir velocidade de desenvolvimento, estabilidade da infraestrutura e capacidade de dimensionamento. Recomenda-se a inscricao de alunos com experiencia em Operacoes ou Desenvolvimento interessados em gerenciar a infraestrutura baseada em conteineres com o Kubernetes! Neste curso, voce aprendera a: - Containerizar um aplicativo criando arquivos de configuracao do Docker e processos de construcao para produzir todas as imagens necessarias do Docker. configurar e lancar uma auto-scaling, o cluster Kubernetes auto-cura - Use Kubernetes para gerenciar a implantacao, ampliacao e atualizacao de seus aplicativos - Empregar as melhores praticas para a utilizacao de recipientes em geral, e especificamente Kubernetes, ao arquitetar e desenvolvimento de novos microservices","12":"Torne-se um especialista em anuncios do Google. Aprenda a criar, executar e obter campanhas de sucesso no Ads para seus resultados com seus produtos e seu negocio.","13":"This course and one format of preparation for entreviques tecnicas. Voce experimentara uma entrevista simulada, revisando uma analise sobre o dominio de perguntas-chave do setor. Tambem revisam topicos comuns de entrevistas para desenvolvedores VR, incluindo graficos 3D e otimizacao de cenas. Aprendera, ainda, boas praticas para responder a questoes comportamentais e chegar a problemas de whiteboard. A partir deste momento, estar preparado (a) para exibir suas habilidades durante uma entrevista para desenvolvedor VR!","14":"Domine as habilidades de visao computacional por tras dos avancos em robotica e automacao. Some programas para analisar imagens, implementar extracao de caracteristicas e programas de indexacao em aprendizagem profunda.","15":"Conceitos basicos de inteligencia artificial com inteligencia como AI como Peter Norvig e Sebastian Thrun, casos que incluem busca, otimizacao, planejamento, reconhecimento de ideias e mais.","16":"O curso Solucao de problemas com o Analytics fornece aos alunos o conhecimento basico para usar a analise de dados para criar percepcoes de negocios.\nVoce vai aprender:","17":"Aprenda a programar em Python e o primeiro passo para uma carreira como Cientista de Dados.","18":"Programacao em Lingua Natural Nanodegree para aprender tecnicas essenciais de PNL, incluindo reconhecimento de fala e traducao automatica. Torne-se um especialista em processamento de linguagem natural, ensinando os computadores a compreender, interpretando e manipulando uma linguagem humana.","19":"Faca parte de uma nova geracao de engenheiros que esta mudando o mundo, usando o poder da robotica para aumentar as capacidades de forma inovadora.","20":"Os carros autonomos sao o futuro do transporte. Saiba o que faz um engenho que faz parte de um projeto nesse setor.","21":"Domine as skills of deep reinforcement learning that thiso impulsionando avancospositentes in AI. Entao, comeca a ser aplicado em projetos de video de uma robotica.","22":"Agora e preciso aprender os fundamentos da inteligencia artificial e os principais conceitos de aprendizagem de maquina. Aprenda a programar em Python, algebra linear, estatistica e visualizacao de dados para construir os melhores modelos preditivos e sua propria rede neural.","23":"Usamos sites o tempo todo, mas como clicar em um link em seu navegador ou digitar um URL na barra de endereco leva voce a um site? Como o servidor sabe quais informacoes voce esta procurando ou como enviar essas informacoes uma vez que elas sao descobertas? Como voce pode proteger seus usuarios contra invasores? Explore este curso e voce podera responder a essas perguntas!\n\nEste curso ira guia-lo atraves de como um cliente se comunica com um servidor. Voce aprendera sobre o ciclo de solicitacao e resposta do HTTP, acessara os cabecalhos e verbos HTTP, distinguira os recursos HTTP \/ 1 dos recursos HTTP \/ 2, tudo isso enquanto experimenta a importancia da seguranca, explorando os detalhes do HTTPS. Ao longo do curso, voce aprendera as praticas recomendadas de seguranca e as maneiras de melhorar o desempenho de seus aplicativos da web. Forneceremos a voce servidores criados manualmente, nos quais voce diagnosticar configuracoes de servidor problematicas, problemas com certificados SSL e ate mesmo a chance de hackear um site de banco de exemplo para transferir fundos.","24":"Aprenda a organizar o codigo para seus aplicativos da web e por que e importante. Voce estara usando o MVC Design Pattern no micro-framework de aplicacoes web, Sinatra.","25":"A demanda por consideracoes blockchain esta aumentando rapidamente. Neste programa, voce trabalha com os protocolos do Bitcoin e do Ethereum, desenvolvendo projetos de aplicacoes reais e adquirindo as competencias essenciais para iniciar uma carreira de aprendiz de blockchain.","26":"O deep learning esta gerando na inteligencia artificial avancos que estao mudando nosso mundo. Clique para ampliar e atualizar suas redes neurais para um fim de produzir solucoes para os desafios importantes.","27":"Complete os reais, criados por especialistas do setor, cobrem os executivos da gestao de ativos com a criacao de sinais de negociacao. Domine os algoritmos de AI para negociar os ativos e construir seu portfolio profissional.","28":"This course and one format of preparation for entreviques tecnicas. Voce experimentara uma entrevista simulada, revisando uma analise detalhada sobre o dominio de perguntas-chaves do setor. Voce tambem pode usar os aplicativos comuns para desenvolvimento de aplicativos Android, incluindo desde implementos explicativos e implicitos a uma pilha de um minimo, aprendendo boas praticas para as questoes comportamentais e problemas de whiteboard. A prepare o curso, estando preparado (a) para ficar atualizado durante uma entrevista para Android!","29":"React esta transformando completamente o Desenvolvimento Front-End. Domine com uma Udacity essa incremente biblioteca da UI do Facebook e torne-se um desenvolvedor web e mobile com React.","30":"This course and one format of preparation for entreviques tecnicas. Voce experimentara uma entrevista simulada, revisando uma analise sobre o dominio de perguntas-chave do setor. Tambem revisaram topicos comuns das entrevistas para o iOS, abrangendo notificacoes para as delegacias do modelo-vista-controlador, aprendendo boas praticas para as perguntas comportamentais e os problemas do whiteboard. Voce sabre como falar sobre seus interesses no desenvolvimento iOS. Desenvolvedores seniores de aplicativos moveis compartilham suas recomendacoes sobre como lidar com problemas comuns de dados. To complete este curso, voce to sendo mais preparado para agendar suas entrevistas durante uma entrevista para desenvolvedor (a) iOS!","31":"Fazer este curso fornecera uma base basica na sintaxe Java, que e o primeiro passo para se tornar um desenvolvedor Java bem-sucedido. Voce aprendera como os computadores tomam decisoes e como o Java rastreia as informacoes por meio de variaveis e tipos de dados. Voce aprendera a criar instrucoes condicionais, funcoes e loops para processar informacoes e resolver problemas. Voce ainda aprendera a usar o IntelliJ, um Java IDE (Ambiente de Desenvolvimento Integrado) que os desenvolvedores profissionais usam para compilar, compilar e depurar seu codigo. Estas sao habilidades de programacao fundamentais, e domina-las e uma obrigacao para todos os aspirantes a programadores.","32":"Neste curso, voce criara o FriendlyChat, um aplicativo de bate-papo em texto e imagens em tempo real.","33":"Profissionais com conhecimento analitico e pratico estao sendo cada vez mais requisitados no mercado. To all the companies with the data the quantity of data to the which companies aso this having which has the same as taking to a mil. Para testar e implementar melhorias, nao ha um site ou aplicativo de mudanca de empresa, uma efetiva concepcao de testes.","34":"Neste curso, voce tera experiencia pratica para tornar os aplicativos da Web acessiveis. Voce entendera quando e por que os usuarios precisam de acessibilidade. Em seguida, voce mergulhara no como: fazer uma pagina funcionar corretamente com leitores de tela e gerenciar o foco de entrada (por exemplo, o destaque que voce ve ao percorrer um formulario). Voce entendera o significado da semantica e da marcacao semantica para paginas da Web e adicionara a marcacao ARIA. uma gama de dispositivos auxiliares. Finalmente, voce aprendera tecnicas de estilo que ajudam os usuarios com visao parcial a navegar nas suas paginas com facilidade e confiabilidade.","35":"Aprendizagem dos fundamentos do iOS usando uma linguagem rapida e o Xcode, uma ferramenta de desenvolvimento da Apple. Voce desenvolveu seus primeiros aplicativos iOS usando layouts, views, UIKit e muito mais.","36":"Aprenda a usar o projeto Design Sprint para testar ideias, alavancar oportunidades e potencializar uma inovacao. Com o acompanhamento de especialistas e muito treinamento pratico, voce pode tomar uma decisao na resolucao de problemas.","37":"This course and ideal to empreendedores that use the universal digital your favor. Realize o seu negocio na internet, aprenda sobre financas e precificacao, otimize seus investimentos de marketing no Facebook, Instagram e Google Ads, e entre na regulamentacao brasileira que impacta sua empresa.","38":"* ou R $ 1999 a vista.","39":"Nesse Curso de Inicializacao, voce aprende como fazer a sua ideia do papel em 12 semanas. Com o exemplo de especialistas do ramo empreendedor e de formacao de pessoas, faca um plano de negocios e tenha uma oportunidade de negociar, melhore sua proposta de valor e aprenda a escalar. No fim, tenha uma chance de apresentar sua ideia em um dia de demonstracao em Sao Paulo.","40":"Profissionais com conhecimento de programacao estao sendo cada vez mais requisitados no mercado. Isso acontece devido ao crescimento constante da digitalizacao de empresas e seus produtos. Para criar novas paginas web e sistemas interativos, o conhecimento de JavaScript e seus conceitos fundamentais e uma habilidade essencial.","41":"Inteligencia Artificial (IA) e um campo que tem longa historia, mas esta esta constantemente crescendo e crescendo. This course, you will learn as in the basic presents of the IA, including algumas das representatives of IA. To along of the path, hope to explore the inumeras applications and Indonesian applications in the area of IA, which continua a expandir-se a human to in our in our imaginacao.","42":"Domine as ultimas ferramentas e tecnologias de VR. Aprenda com especialistas do setor, como Google, Unity e HTC, e torne-se desenvolvedor (a) de realidade virtual.","43":"Adquirindo competencias para a construcao de aplicacoes web do inicio de uma interface do servidor. Aprendizagem e pesquisa do Vale do Silicio e impulsao de seu curriculo para o trabalho em produtos emergentes de startups ou de grandes empresas.","44":"Aprenda a fazer os preditivos que o Iraque possibilita a agir, aprender e tomar decisoes baseadas em dados. Voce aprendeu os conceitos fundamentais de avaliacao e validacao de modelos, aprendizagem supervisionada, aprendizagem nao-supervisionada, aprendizagem por reforco e aprendizagem profunda.","45":"Comece a aprender como e facil de usar uma Cientista de Dados. Estude de Forma Pratica Estatistica e Probabilidade e Como Fazer o Simples do Que Imagina. Aprender a lancar e apagar dados para realizar melhores analises e diferenciar-se com uma introducao em Maquina Aprendendo a fazer um modelo de comutacao mapear futur","46":"Adquirir skills relacionados a analyses de dados tem sido um grande diferencial para os profissionais do mercado atual. Tomar decisoes mais precisas, antecipar tendencias e analisar variaveis sao alguns dos estudos que voce pode realizar. E tudo isso sem precisar de experiencia em programacao!","47":"Comecar um adquirir as habilidades para um perfil analitico aprendendo Excel, SQL e visualizacao de dados.","48":"Google e Udacity create this course for you aprofunde os their languages in development Android. Os seus aplicativos Android mais completos atraves da integracao com APIs e bibliotecas, widgets e arquivos de midia, gerenciamento de dados e informacoes que rodam em segundo plano.","49":"Aprender na pratica com o Google e Udacity conceitos avancados de desenvolvimento Android. Torne seus aplicativos ainda mais completos e escalaveis com Gradle, Material Design, Google Play Services e Firebase.","50":"Aprenda os conceitos basicos da programacao Android e Java e de o primeiro passo na sua jornada para se tornar um desenvolvedor Android!","51":"Domine os fundamentos de back-end, bancos de dados a servidores web, e desenvolva competencias competitivas para esta area com especialistas do Vale do Silicio.","52":"Profissionais com conhecimento analitico estao sendo cada vez mais requisitados no mercado. Todas as empresas estao com registro de dados de todos os empresas estao tendo que lidar. Para resumir e visualizar como caracteristicas importantes de um conjunto de dados, uma analise exploratoria de dados atraves da linguagem R e uma habilidade essencial.","53":"Domine a construcao e deploy de aplicacoes web multiusuarios utilizando o Flask, um microframework em Python versatil e flexivel used por grandes empresas, tais como Netflix, Uber e LinkedIn. Por fim, uma vez que os sistemas de autenticacao como o Google e Facebook, implementam APIs RESTful e fazer deploy em servidores Linux.","54":"A sua interface como desenvolvedor web e uma ferramenta de desenvolvimento de interfaces, performance e performance. Domine as skills fundamental exigidas in recommendations professionals and amplie their horizontes neste mercado que nunca para de crescer.","55":"Aprenda a criar aplicativos completos, escalonaveis e de alto desempenho para iOS de forma simples e se aplicamvel. Amplie seus horizontes este mercado que nunca para de crescer.","56":"Dez minutos para esta aula, voce fara sua propria versao completamente personalizada do insana e viciante jogo 2048. Mesmo que voce nunca tenha codificado antes. Muito legal, nao? Voce fara isso fazendo pequenas (mas importantes) modificacoes no codigo fonte do jogo original de 2048. Se isso soa intimidante, nao se preocupe. Vamos ensinar os conceitos basicos de HTML e CSS e como eles interagem com o Javascript (nao se preocupe se essa frase nao significa nada para voce ainda. Sera em breve). O objetivo desta aula e se divertir aprendendo como para rapidamente e facilmente pegar um programa de codigo aberto existente, fazer algumas mudancas e criar algo que pareca e seja completamente novo. O jogo que voce criar sera compativel com dispositivos moveis (voce podera usa-lo em seu telefone!) E totalmente compartilhavel.","57":"Google e Udacity construir este curso online de desenvolvimento Android para comecar a sua jornada de programacao movel! Aprender uma linguagem Java e comecar a usar os aplicativos para dispositivos de pesquisa!","58":"This introduction the course of computer computing, when you are learnt and practive concepts of the computational computational computators, construindo suas proprias versoes de aplicacoes web popular. Voce vai aprender Python, uma linguagem de programacao poderosa, facil de aprender, e amplamente utilizado, e voce vai explorar nocoes basicas de informatica, construindo seu proprio motor de busca e rede social.","59":"Aprenda a lidar com problemas de big data com seus proprios clusters do Hadoop! Neste curso, voce implantara clusters do Hadoop na nuvem e os usara para obter insights de grandes conjuntos de dados.","60":"Este curso destina-se a ensinar os alunos a compreender e identificar as diferencas entre as linguagens de programacao Objective-C e Swift e, em especial, como reescrever do primeiro para o ultimo. Entender as comunicacoes entre as duas linguagens de \"interoperabilidade\" esta se tornando cada vez mais importante para os desenvolvedores, especialmente a medida que nos preparamos para a chegada do Swift 3.0. No curso, os alunos irao escrever aulas e adicionar funcionalidade as aulas, escrevendo e chamando metodos. Depois de aprender alguma sintaxe basica do Objective-C, os alunos examinarao e dividirao um aplicativo escrito em Objective-C e o reescreverao no Swift. O curso terminara com uma revisao e pratica dos desafios mais comuns de interoperabilidade entre Objective-C e Swift.","61":"Aqui esta uma pergunta importante que os desenvolvedores do Android perguntam ao criar aplicativos:","62":"O Pete LePage do Google! Voce vai criar sua propria pagina web responsiva que funciona bem em qualquer dispositivo - telefone, tablet, desktop ou qualquer outro. Voce vai comecar a explorar o que um site agil e como alguns padroes comuns de design responsivo funciona em diferentes dispositivos. A partir do uso de consultas de midia do CSS e um viewport de tags. You are the testing to interrupcao to larger and lower to the reading and lower to reading.","63":"Nesta aula de programacao introdutoria, voce vai aprender Programacao Orientada a Objetivos, uma tecnica importante para os engenheiros de software que permitem uma reutilizacao e compartilhamento de codigo com facilidade. Voce vai aprender fazendo, e vai fazer um mini projeto em cada licao para aprender e a executar os conceitos de programacao.","64":"Este curso apresentara o conteudo disponivel por meio das APIs do Google Maps. Voce passara pela construcao de um site de listagens de imoveis passo a passo, usando um mapa do Google com um belo estilo, visualizacao de dados, panoramas de exibicao de rua e varios recursos interessantes relacionados ao local, como calcular a distancia entre locais, obter direcoes e visualizar locais de dados de juros. Voce tambem vera outros exemplos de APIs do Google Maps em acao e entendera como colocar seu novo conhecimento em pratica criando seu proprio projeto no Console de APIs do Google.","65":"This course and one format of preparation for entreviques tecnicas. Voce experimentara uma entrevista simulada, revisando uma analise sobre o dominio de perguntas-chave do setor. Revistas topicas comuns em entrevistas para desenvolvedores Full Stack, como os funcoes em paleta e estrutura de dados. Aprendera, ainda, boas praticas para questoes comportamentais e problemas de whiteboard. Em primeiro lugar, estar preparado (a) para manter-se informado durante uma entrevista para o Full Stack!","66":"Voce tem alguma experiencia desenvolvendo aplicativos para iPhone ou iPad e gostaria de criar um aplicativo para zero, mas nao sabe por onde comecar? Nao procure mais! This study, aprende a efetuar todo o processo de criacao de um aplicativo iOS, comecando com uma ideia inicial e terminando com uma publicacao na App Store.","67":"Aprenda os fundamentos da visualizacao de dados e pratique a comunicacao com os dados. Este curso aborda como aplicar principios de design, percepcao humana, teoria de cores e contar historias com dados. Se voce apresentar dados a outros, aspirar a ser um analista de negocios ou um cientista de dados, ou se quiser se tornar mais eficiente com ferramentas de visualizacao, podera aumentar suas habilidades com esse curso.\n\n\nEste curso e parte dos Programas de Previsao de Negocios e de Nanodegree Data Analyst.","68":"Este curso conduziu uma entrevista simulada, oferecendo analise sobre o dominio de perguntas-chave do setor. Voce revisara topicos common questions to developers front-end, abrangendo funcoes e fechos de palhetons e aprendizado de boas praticas para as questoes comportamentais e problemas de whiteboard. Em primeiro lugar, voce deve estar apto a (a) front-end!","69":"O curso Criando um Conjunto de Dados Analitico fornece aos alunos um conhecimento basico para inserir, limpar, mesclar e formatar dados em preparacao para a analise. Voce vai aprender:","70":"Esse curso do Google Analytics inclui aulas de treinamento avancado e treinamento pratico para uma ferramenta principal de analise da web. Aprenda a criar paineis, indicar o comportamento dos utilizadores, avaliar as campanhas de marketing digital e impulsionar o crescimento do seu negocio.","71":"O GitHub e uma plataforma mais conceituada para demonstrar seus projetos de programacao. Alguns recrutadores tecnicos e geradores de contratacao de uso, inclusive, para encontrar candidatos. This course, voce learn with knowledge technical as well praticas to GitHub. Tambem realizara comparacoes entre diferentes estilos de alteracao de commits, forking de repositorios e merging de solicitacoes de atualizacao. Compreender, ainda, como organizar seu codigo para finalizar seus projetos tecnicos. Alem disso, aprender a colaborar com outros engenheiros no GitHub. Gerentes de contratacao de tecnicos compartilham dicas sobre seu perfil do GitHub que possibilitam mais oportunidades de emprego. Adquira uma confianca necessaria para estabelecer sua presenca na comunidade open source.","72":"Neste curso, voce aprendera como usar o Firebase com os especialistas do Google. O Firebase e uma plataforma de desenvolvimento de aplicativos que fornecem as melhores opcoes de recursos e uma capacidade de plataforma, permitindo a criacao de aplicativos de alta qualidade com rapidez. Neste curso, voce cria o FriendlyChat, um bate-papo de imagem e texto em tempo real. Para comecar, voce tem como e facilitar e gravar dados no Firebase. Depois disso, aprender a permitir o login dos usuarios com um e-mail ou conta do Google. Em seguida, sera capacitado para usar uma linguagem de seguranca e regras do Firebase para adicionar permissoes a seus dados e protegidos. Na segunda aula, voce conhecera o Firebase Storage, que permite que os usuarios faam upload do conteudo de seus dispositivos. Na sequencia, ter uma visao geral do Firebase Analytics para poder analisar os dados de uso do aplicativo e tomar decisoes. Depois disso, voce pode obter notificacoes do Firebase, sendo capaz de enviar notificacoes a dados personalizados de usuarios. Por fim, voce entende como as configuracoes remotas do Firebase, para poder sintonizar e planejar seu aplicativo sem necessidade de publicar uma nova versao. This is that goo and the software to Android, which can storage and sharing data to different users in real time, bem como authenticate and autorizar ones usuarios.","73":"Neste curso, voce aprendera as melhores praticas para criar interfaces do iOS. Voce construira interfaces adaptaveis que se adaptam a diferentes ambientes de exibicao, animam elementos de interface do usuario e exibem transicoes e analisam designs de aplicativos populares na App Store."},"title":{"0":"Curso de Introdução à Programação - Nanodegree Udacity","1":"Desenvolvimento de aplicativos Android","2":"Curso de Google Ads | Conheça o Nanodegree da Udacity","3":"Client-Server Communication","4":"Web Accessibility","5":"Curso de Data Science | Nanodegree Fundamentos de Data Science II da Udacity","6":"Make Your Own 2048","7":"Data Visualization in Tableau","8":"Firebase em um fim de semana com o Google: Android","9":"Building iOS Interfaces","10":"Construindo sua marca pessoal online","11":"Visualizing Algebra","12":"Introdução à Estatística Descritiva","13":"Android Basics: Networking","14":"Intro to Progressive Web Apps","15":"Android Basics: Multi-screen Apps","16":"Server-Side Swift","17":"Aprimore seu currículo","18":"HTML and CSS Syntax","19":"Scalable Microservices with Kubernetes","20":"Entrevista técnica: Realidade Virtual VR","21":"Computer Vision Expert","22":"Artificial Intelligence Concepts","23":"Problem Solving with Advanced Analytics","24":"Curso de Python: Fundamentos de Data Science I – Udacity","25":"Natural Language Processing Expert","26":"Curso de Robótica | Conheça o Nanodegree Engenheiro de Robótica","27":"Curso de Introdução a Carros Autônomos","28":"Nanodegree Deep Reinforcement Learning Expert | Udacity","29":"Curso de Machine Learning | Nanodegree Fundamentos de Machine Learning da Udacity","30":"The MVC Pattern in Ruby","31":"Nanodegree Desenvolvedor Blockchain","32":"Curso de Deep Learning | Conheça o Nanodegree da Udacity","33":"Artificial Intelligence for Trading | Udacity","34":"Entrevista técnica: Android","35":"Curso de React: Nanodegree Desenvolvedor React | Udacity","36":"Entrevista técnica: iOS","37":"Java Programming Basics","38":"Firebase in a Weekend by Google: iOS","39":"Teste A\/B","40":"Curso de iOS | Conheça o Nanodegree Desenvolvedor iOS da Udacity","41":"Design Sprint: conheça o método e nosso curso | Udacity","42":"Curso de Negócios Digitais | Conheça o curso de pequenos negócios da Udacity","43":"Curso de Data Science - Big Data, Engenharia de Software e Machine Learning","44":"Curso de Startup | Aprenda como criar uma startup no Nanodegree Startup Founder","45":"Fundamentos de JavaScript","46":"Introdução à Inteligência Artificial","47":"Curso Desenvolvedor de Realidade Virtual | Conheça o Nanodegree da Udacity","48":"Curso Online de Desenvolvimento Web Full Stack | Nanodegree Udacity","49":"Curso de Engenheiro de Machine Learning | Nanodegree da Udacity","50":"Curso de Analista de Negócios | Nanodegree Análise de Dados da Udacity","51":"Curso Análise de Dados: Fundamentos e Introdução | Udacity","52":"Curso de Desenvolvimento Android Online | Nanodegree da Udacity","53":"Curso de Desenvolvimento Android Online | Nanodegree da Udacity","54":"Android Basics: User Interface","55":"Curso de Desenvolvimento Back End | Nanodegree da Udacity","56":"Análise de Dados com R","57":"Curso de Desenvolvimento Back End | Nanodegree da Udacity","58":"Front-End: curso online de fundamentos web | Udacity","59":"Curso de iOS | Conheça o Nanodegree Desenvolvedor iOS da Udacity","60":"Comece o Curso de desenvolvimento Android Online | Nanodegre Android Basics","61":"Introdução à Ciência da Computação","62":"Deploying a Hadoop Cluster","63":"Objective-C for Swift Developers","64":"How to create &lt;anything&gt in Android","65":"Fundamentos do Design Responsivo para a Web","66":"Fundamentos da Programação com Python","67":"Google Maps APIs","68":"Entrevista técnica: Full Stack","69":"Como criar um aplicativo iOS","70":"Entrevista técnica: Front-end","71":"Creating an Analytical Dataset","72":"Google Analytics: curso online de web analytics | Udacity","73":"Otimizando seu perfil do GitHub"},"intro":{"0":1,"1":0,"2":0,"3":0,"4":0,"5":1,"6":0,"7":0,"8":0,"9":0,"10":0,"11":0,"12":0,"13":0,"14":0,"15":0,"16":0,"17":0,"18":0,"19":0,"20":0,"21":0,"22":1,"23":0,"24":1,"25":0,"26":0,"27":0,"28":0,"29":1,"30":0,"31":0,"32":0,"33":0,"34":0,"35":1,"36":0,"37":0,"38":0,"39":0,"40":0,"41":0,"42":0,"43":0,"44":0,"45":1,"46":0,"47":0,"48":0,"49":0,"50":0,"51":1,"52":0,"53":0,"54":0,"55":0,"56":0,"57":0,"58":1,"59":0,"60":0,"61":0,"62":0,"63":0,"64":0,"65":1,"66":1,"67":1,"68":0,"69":0,"70":0,"71":0,"72":0,"73":0},"mobile":{"0":0,"1":0,"2":0,"3":0,"4":0,"5":0,"6":0,"7":0,"8":0,"9":0,"10":0,"11":0,"12":0,"13":0,"14":0,"15":0,"16":0,"17":0,"18":0,"19":0,"20":0,"21":0,"22":0,"23":0,"24":0,"25":0,"26":0,"27":0,"28":0,"29":0,"30":0,"31":0,"32":0,"33":0,"34":0,"35":0,"36":0,"37":0,"38":0,"39":0,"40":0,"41":0,"42":0,"43":0,"44":0,"45":0,"46":0,"47":0,"48":0,"49":0,"50":0,"51":0,"52":0,"53":0,"54":0,"55":0,"56":0,"57":0,"58":0,"59":0,"60":0,"61":0,"62":0,"63":0,"64":0,"65":0,"66":0,"67":0,"68":0,"69":0,"70":0,"71":0,"72":0,"73":0},"web":{"0":0,"1":0,"2":0,"3":1,"4":1,"5":0,"6":1,"7":0,"8":0,"9":0,"10":1,"11":0,"12":0,"13":0,"14":1,"15":0,"16":0,"17":0,"18":1,"19":0,"20":0,"21":0,"22":0,"23":1,"24":0,"25":0,"26":0,"27":0,"28":0,"29":0,"30":0,"31":0,"32":0,"33":0,"34":1,"35":0,"36":0,"37":0,"38":0,"39":0,"40":1,"41":0,"42":0,"43":1,"44":0,"45":0,"46":0,"47":0,"48":1,"49":0,"50":0,"51":0,"52":0,"53":1,"54":1,"55":0,"56":1,"57":0,"58":0,"59":0,"60":0,"61":0,"62":1,"63":0,"64":0,"65":0,"66":0,"67":0,"68":0,"69":0,"70":1,"71":0,"72":1,"73":0},"python":{"0":0,"1":0,"2":0,"3":0,"4":0,"5":0,"6":0,"7":0,"8":0,"9":0,"10":0,"11":0,"12":0,"13":0,"14":0,"15":0,"16":0,"17":1,"18":0,"19":0,"20":0,"21":0,"22":0,"23":0,"24":0,"25":0,"26":0,"27":0,"28":0,"29":0,"30":0,"31":0,"32":0,"33":0,"34":0,"35":0,"36":0,"37":0,"38":0,"39":0,"40":0,"41":0,"42":0,"43":0,"44":0,"45":0,"46":0,"47":0,"48":0,"49":0,"50":0,"51":0,"52":0,"53":0,"54":0,"55":0,"56":0,"57":0,"58":0,"59":0,"60":0,"61":0,"62":0,"63":0,"64":0,"65":0,"66":0,"67":0,"68":0,"69":0,"70":0,"71":0,"72":0,"73":0},"android":{"0":0,"1":1,"2":0,"3":0,"4":0,"5":0,"6":0,"7":0,"8":0,"9":0,"10":0,"11":0,"12":0,"13":1,"14":0,"15":1,"16":0,"17":0,"18":0,"19":0,"20":0,"21":0,"22":0,"23":0,"24":0,"25":0,"26":0,"27":0,"28":0,"29":0,"30":0,"31":1,"32":0,"33":0,"34":0,"35":0,"36":0,"37":0,"38":0,"39":0,"40":0,"41":0,"42":0,"43":0,"44":0,"45":0,"46":0,"47":0,"48":0,"49":0,"50":1,"51":0,"52":1,"53":0,"54":0,"55":0,"56":0,"57":0,"58":0,"59":0,"60":1,"61":1,"62":0,"63":0,"64":0,"65":0,"66":0,"67":0,"68":0,"69":0,"70":0,"71":0,"72":0,"73":0},"ios":{"0":0,"1":0,"2":0,"3":0,"4":0,"5":0,"6":0,"7":0,"8":0,"9":1,"10":0,"11":0,"12":0,"13":0,"14":0,"15":0,"16":1,"17":0,"18":0,"19":0,"20":0,"21":0,"22":0,"23":0,"24":0,"25":0,"26":1,"27":0,"28":0,"29":0,"30":1,"31":0,"32":0,"33":0,"34":0,"35":0,"36":1,"37":0,"38":0,"39":1,"40":0,"41":0,"42":0,"43":0,"44":0,"45":0,"46":0,"47":0,"48":0,"49":0,"50":0,"51":0,"52":0,"53":0,"54":0,"55":1,"56":0,"57":0,"58":0,"59":0,"60":0,"61":0,"62":0,"63":0,"64":0,"65":0,"66":0,"67":0,"68":0,"69":1,"70":0,"71":0,"72":0,"73":1},"machine learning":{"0":0,"1":1,"2":0,"3":0,"4":0,"5":0,"6":0,"7":0,"8":0,"9":1,"10":0,"11":0,"12":0,"13":1,"14":0,"15":1,"16":1,"17":1,"18":0,"19":1,"20":1,"21":1,"22":0,"23":0,"24":0,"25":1,"26":1,"27":1,"28":1,"29":0,"30":1,"31":1,"32":1,"33":0,"34":0,"35":0,"36":1,"37":0,"38":0,"39":1,"40":0,"41":1,"42":0,"43":0,"44":1,"45":0,"46":1,"47":1,"48":0,"49":0,"50":1,"51":0,"52":1,"53":0,"54":0,"55":1,"56":0,"57":0,"58":0,"59":0,"60":1,"61":1,"62":0,"63":1,"64":0,"65":0,"66":0,"67":0,"68":1,"69":1,"70":0,"71":0,"72":0,"73":1},"google":{"0":0,"1":0,"2":1,"3":0,"4":0,"5":0,"6":0,"7":0,"8":1,"9":0,"10":0,"11":1,"12":1,"13":0,"14":0,"15":0,"16":0,"17":0,"18":0,"19":0,"20":0,"21":0,"22":0,"23":0,"24":0,"25":0,"26":0,"27":0,"28":0,"29":0,"30":0,"31":0,"32":0,"33":0,"34":0,"35":0,"36":0,"37":1,"38":1,"39":0,"40":0,"41":0,"42":1,"43":0,"44":0,"45":0,"46":0,"47":0,"48":0,"49":1,"50":0,"51":0,"52":0,"53":0,"54":0,"55":0,"56":0,"57":1,"58":0,"59":0,"60":0,"61":0,"62":0,"63":0,"64":1,"65":0,"66":0,"67":0,"68":0,"69":0,"70":0,"71":0,"72":0,"73":0},"data science":{"0":0,"1":0,"2":0,"3":0,"4":0,"5":0,"6":0,"7":1,"8":0,"9":0,"10":0,"11":0,"12":0,"13":0,"14":0,"15":0,"16":0,"17":0,"18":0,"19":0,"20":0,"21":0,"22":0,"23":0,"24":0,"25":0,"26":0,"27":0,"28":0,"29":0,"30":0,"31":0,"32":0,"33":1,"34":0,"35":0,"36":0,"37":0,"38":0,"39":0,"40":0,"41":0,"42":0,"43":0,"44":0,"45":0,"46":0,"47":0,"48":0,"49":0,"50":0,"51":0,"52":0,"53":0,"54":0,"55":0,"56":0,"57":0,"58":0,"59":1,"60":0,"61":0,"62":0,"63":0,"64":0,"65":0,"66":0,"67":0,"68":0,"69":0,"70":0,"71":1,"72":0,"73":0},"vr":{"0":0,"1":0,"2":0,"3":0,"4":0,"5":0,"6":0,"7":0,"8":0,"9":0,"10":0,"11":0,"12":0,"13":0,"14":0,"15":0,"16":0,"17":0,"18":0,"19":0,"20":1,"21":0,"22":0,"23":0,"24":0,"25":0,"26":0,"27":0,"28":0,"29":0,"30":0,"31":0,"32":0,"33":0,"34":0,"35":0,"36":0,"37":0,"38":0,"39":0,"40":0,"41":0,"42":0,"43":0,"44":0,"45":0,"46":0,"47":0,"48":0,"49":0,"50":0,"51":0,"52":0,"53":0,"54":0,"55":0,"56":0,"57":0,"58":0,"59":0,"60":0,"61":0,"62":0,"63":0,"64":0,"65":0,"66":0,"67":0,"68":0,"69":0,"70":0,"71":0,"72":0,"73":0}}